[
  {
    "search_keyword": "stage data science",
    "title": "Data & AI-Internship Program",
    "company": "Capgemini Engineering",
    "location": "Casablanca",
    "description": "Capgemini Engineering, leader mondial des services d'ingénierie, rassemble des équipes d'ingénieurs, de scientifiques et d'architectes pour aider les entreprises les plus innovantes dans le monde à libérer leur potentiel. Des voitures autonomes aux robots qui sauvent des vies, nos experts en technologies digitales et logicielles sortent des sentiers battus en fournissant des services uniques de R&D et d'ingénierie dans tous les secteurs d'activité. Rejoignez-nous pour une carrière pleine d'opportunités, où vous pouvez faire la différence et où aucun jour ne se ressemble.\nA propos du stage\nNous sommes à la recherche d’un(e ) stagiaire PFE passionné(e) pour rejoindre notre équipe Data & AI en tant que Data & AI Intern – Automotive Systems. Ce stage représente une opportunité unique d’acquérir une expérience concrète dans le domaine de la donnée et de l’intelligence artificielle appliquées aux systèmes automobiles, en participant à des projets variés allant de la collecte et l’analyse de données techniques à la mise en œuvre de solutions intelligentes pour l’optimisation des performances mécaniques.\nLieu : Casablanca\nDurée : 6 mois, à partir de février\nNiveau : Étudiant(e) en Master ou équivalent ( Data science, ingénierie mécanique, ou domaine connexe)\nLangues : Bon niveau en français et en anglais requis\nLes missions du stage\nAnalyse des données mécaniques pour identifier des tendances et anomalies.\nDéveloppement de modèles prédictifs pour la maintenance et la performance.\nIntégrer de nouvelle solutions AI\nParticiper aux projets d'innovation dans le domaine de la gestion de la data BOM\n\n\nVotre profil\nÉtudiant(e) en Master : Data science, ingénierie mécanique, systèmes embarqués ou domaine lié aux technologies des véhicule\nIntérêt fort pour l’intelligence artificielle et l’analyse de données appliquées à l’automobile.\nBonne communication écrite et orale .\nAutonomie, rigueur et sens de l’organisation dans la gestion des projets data.\nNos engagements et priorités:\nLe groupe Capgemini encourage une culture inclusive dans un cadre multiculturel et handi-accueillant. En nous rejoignant, vous intégrez un collectif qui valorise la diversité, développe le potentiel de ses talents, s’engage dans des initiatives solidaires avec ses partenaires, et se mobilise pour réduire son impact environnemental sur tous ses sites et auprès de ses clients.\nCapgemini est un leader mondial, responsable et multiculturel, regroupant près de 350 000 personnes dans plus de 50 pays. Fort de 55 ans d’expérience, nous sommes un partenaire stratégique des entreprises pour la transformation de leurs activités en tirant profit de toute la puissance de la technologie et des innovations dans les domaines en perpétuelle évolution tels que le cloud, la data, l’Intelligence Artificielle, la connectivité, les logiciels, l’ingénierie digitale ou les plateformes.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=402984caab7a2b99&bb=Yi4yc9VkUAbgImntF7B2UHzrj401ez77-S9L-6yGRv550HesjSGCAmtVQY5NGTMTzaFszD1zO1AJTtbo01HRXLWqrmYwe8Z6z6F5k-B5gjxPHZ1goKueNlKfpYIo9zPRGxHKyrUy-ha4bhjlXqY7pA%3D%3D&xkcb=SoDY67M3qzXb-hzNkp0LbzkdCdPP&fccid=80402dcb603cbc8d&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=402984caab7a2b99&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=fbb2392e1bfd080d&assa=9973",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "Stage PFE : IA / NLP — Fine-Tuning à partir de PDFs",
    "company": "Koding Schools",
    "location": "Remote",
    "description": "Offre de Stage : IA / NLP — Fine-Tuning à partir de PDFs\nKoding Schools, basée à Marrakech, évolue dans le domaine de la Ed-Tech et conçoit des solutions innovantes d’apprentissage digital intégrées à WordPress, LearnDash et BuddyBoss.\nDans le cadre du développement de nos outils pédagogiques, Koding Schools recherche un(e) stagiaire passionné(e) par l’IA, le traitement du langage naturel (NLP) et les modèles LLM, pour travailler sur la création d’un assistant intelligent entraîné sur nos contenus internes.\nCe que nous offrons :\n● Une mission à impact dans le domaine de l’éducation digitale\n● Un travail stimulant autour des IA modernes (Mistral, Phi, Falcon…)\n● Une autonomie totale en télétravail (100 %)\n● Un environnement technique basé sur WordPress, LearnDash & Python\n● La possibilité de travailler sur un projet concret utilisé par nos élèves\n● Encadrement par l’équipe technique Koding Schools\n● Une ambiance bienveillante et axée sur la créativité\nCe que nous recherchons :\n● Un(e) étudiant(e) curieux(se), autonome et motivé(e) par les technologies IA\n● À l’aise avec l’extraction de données, Python, et le NLP\n● Capable d’apprendre rapidement et de proposer ses propres idées\n● Bonne communication et sens du travail en équipe\nCompétences techniques attendues :\nTraitement IA / NLP\n● Python (indispensable)\n● Bibliothèques d’extraction PDF : PyMuPDF, pdfplumber, PDFMiner\n● Connaissance des workflows NLP (préprocessing, tokenisation, datasets)\n● Notions de fine-tuning LLM (HuggingFace, OpenAI, GanzAI…)\n]● Compréhension des modèles modernes : Deepseek , Mistral, Phi, Falcon, etc.\nDéveloppement & Intégration\n● Notions d’API REST (PHP ou Python)\n● Connaissance de WordPress est un plus\n● Intégration web (Elementor, LearnDash) — bonus\n● Git / GitHub (CI/CD simple apprécié)\nInfrastructure / DevOps (Bonus)\n● Utilisation de plateformes d’entraînement (Colab, AWS, HF Spaces)\n● Notions de sécurité & optimisation\nProfil recherché :\n● Étudiant(e) en informatique / IA / Data Science\n● À l’aise avec Python et l’extraction de données\n● Sensibilité pour l’IA générative et les modèles LLM\n● Force de proposition pour améliorer nos outils IA\n● Capacité à produire documentation et livrables structurés\nMission du stage (Roadmap)\nPhase 1 — Exploration & Définition (Sem. 1–2)\nDécouverte WordPress, LearnDash, WPML\nAnalyse des PDFs des leçons LearnDash\nDéfinition du format dataset (JSON, YAML…)\nPhase 2 — Extraction & Structuration (Sem. 3–4)\nExtraction texte (PyMuPDF, pdfplumber…)\nNettoyage : titres, paragraphes, QCM\nTransformation en Q/A ou passages contextuels\nPhase 3 — Fine-tuning (Sem. 5–8)\nChoix du modèle (Mistral, Phi…)\nGénération dataset compatible fine-tuning\nEntraînement + évaluation (hallucinations, précision)\nPhase 4 — Intégration WordPress (Sem. 9–10)\nCréation API REST sécurisée\nIntégration via plugin ou backend Python\nWidget Elementor ou block LearnDash d’interaction\nPhase 5 — Finalisation (Sem. 11–12)\nTests multi-langues avec WPML\nSécurité, mise en production, rollback\nDocumentation complète + rapport final\nLivrables attendus :\n● Script d’extraction PDF LearnDash\n● Dataset JSON structuré (Q/A ou passages)\n● Modèle fine-tuné + rapport d’évaluation\n● API sécurisée WordPress\n● Démo fonctionnelle (staging KodingSchools)\n● Documentation technique & bilan de stage\nLangages & technologies :\nPython, NLP, Transformers, HuggingFace, WordPress (base), PHP (API), JSON, GitHub, LearnDash, WPML.\nType de contrat :\nStage — 3 à 6 mois\nInformations complémentaires :\nTélétravail 100 %\nDébut : immédiat\nIndemnisation : selon profil\nEnvoyez votre CV à hello@kodingschools.com avec comme objet : Stage PFE : IA / NLP\nJob Type: Internship\nContract length: 6 months",
    "job_url": "https://ma.indeed.com/rc/clk?jk=20cdaba4e8848cbe&bb=Yi4yc9VkUAbgImntF7B2UHzrj401ez77xbkp_ZzkBTRZkcsSGB26ZHB87HTNkHjDo1EGRcKjf18OZxvLcO2bh_naOVgl_XSuFjGh7d9EydCUoeLFEhsKfHhEHmXad5HQBs9nG5O-Lz5IA5axcqiyMLZj5XjnjUCR&xkcb=SoBs67M3qzXb-hzNkp0KbzkdCdPP&fccid=39d680ec11bc46bf&cmp=Koding-Schools&ti=Stage+Pfe+%3A+Ia+%2F+Nlp+%E2%80%94+Fine-tuning+%C3%80+Partir+De+Pdfs&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "Offre de Stage – Développeur en Intelligence Artificielle (IA)",
    "company": "AI HUB",
    "location": "Rabat",
    "description": "Lieu : AI Hub / – Rabat\nDurée : 3 mois\nDébut : Dès que possible\nDescription du poste\nAI Hub propose un stage formateur pour un(e) développeur(euse) en intelligence artificielle passionné(e) par les nouvelles technologies et curieux(se) d’explorer les applications concrètes de l’IA.\nCe stage vous permettra d’acquérir une première expérience pratique au sein d’un environnement innovant et collaboratif.\nMissions principales\nParticiper à la conception et au développement de prototypes d’outils basés sur l’IA\nTravailler sur des projets en lien avec le traitement de données, l’automatisation et le machine learning\nRéaliser des tests et documenter les résultats\nAssister l’équipe technique dans la mise en place de solutions IA internes\nVeille technologique sur les tendances et outils IA\nProfil recherché\nÉtudiant(e) en informatique, data science ou domaine connexe\nConnaissance de base en Python, TensorFlow, ou PyTorch\nIntérêt marqué pour le machine learning, la data et l’automatisation\nEsprit analytique, rigoureux et curieux\nCapacité à travailler en équipe et à apprendre rapidement\nConditions\nStage rémunéré\nAttestation de stage fournie\nHoraires : du lundi au vendredi, 09h00 à 17h30 –\nCandidature\nEnvoyez votre CV à : team@hub4digi.com\nObjet : Stage – Développeur IA\nType d'emploi : Temps plein, Stage\nDurée du contrat : 3 mois\nType d'emploi : Temps plein",
    "job_url": "https://ma.indeed.com/rc/clk?jk=9ee11eddef435923&bb=Yi4yc9VkUAbgImntF7B2UFbyn36CaqiasBvgNQ2CSif1gaF7Y_akH48Ufo6F6AIkq3UGJDXT462WNdgB9aALAdjyS5Z6N5RllG6md7PL1WyOVpPIfeO03HCOos-6T5kxoWkUpAzp-CDOhwb-h6NfACIn6LQVZprY&xkcb=SoDx67M3qzXb-hzNkp0JbzkdCdPP&fccid=e29cad4ea4d93ed1&cmp=AI-Hub&ti=Stage+D%C3%A9veloppeur&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "Stage pré-embauche Data Engineer (GCP & Terraform) – 3 mois",
    "company": "Metaverse",
    "location": "Casablanca",
    "description": "À propos de nous :\nMetaverse est une organisation tournée vers l'avenir, engagée en faveur de l'innovation et de la technologie. Nous nous consacrons à la création de solutions de pointe qui ont un impact dans divers secteurs. Alors que nous continuons à grandir, nous recherchons des talents motivés et enthousiastes pour rejoindre notre équipe.\nAperçu du poste :\nNous recherchons un(e) Stagiaire Data Engineer (GCP) – Stage pré-embauche de 3 mois pour travailler en étroite collaboration avec notre équipe d'ingénierie des données. Ce stage offre une excellente opportunité pour les aspirant(e)s ingénieurs des données d'acquérir une expérience pratique, s’intégrer au projet client, et préparer une embauche future.\nResponsabilités principales :\nCollaborer avec les ingénieurs seniors pour concevoir, construire et maintenir des pipelines de données et des processus ETL.\nParticiper à l'intégration et à la transformation de données provenant de diverses sources.\nContribuer à l'optimisation et à l'amélioration des performances des pipelines existants.\nAider au développement et à la maintenance des entrepôts de données et bases de données.\nTravailler avec les analystes et scientifiques des données pour garantir la disponibilité et la fiabilité des données.\nDocumenter et communiquer les processus et bonnes pratiques en ingénierie des données.\nParticiper à la gestion de l’infrastructure via des outils d’infrastructure as code, notamment Terraform.\nQualifications :\nÉtudiant(e) en dernière année de Master (BAC+5) en Informatique, Data Engineering ou filière technique connexe, ou diplômé(e) récemment.\nFort intérêt pour l'ingénierie des données et les technologies associées.\nMaîtrise de Python, SQL, Google Cloud Platform (GCP), AWS, Apache Spark et Terraform (obligatoire).\nFamiliarité avec la science des données, les processus ETL, le NLP et le Machine Learning.\nBonnes compétences en résolution de problèmes et sens du détail.\nCapacités de communication et esprit d'équipe.\nModalités du stage pré-embauche :\nDurée : 3 mois\nStage d’intégration sur projet client, en vue d’une embauche éventuelle à l’issue du stage.\nPériode à discuter selon disponibilité.\nLocalisation : Casablanca, Maroc.\nComment postuler ?\nEnvoyez votre CV à recruitment@metave.us en mentionnant l’objet :\n\"Candidature – Stage pré-embauche Data Engineer\".\nInformations complémentaires :\nHoraires : Lundi - Vendredi (9h - 17h) / Samedi (9h - 13h en télétravail)\nDisponibilité : Immédiate\nType d'emploi : Temps plein (stage)\nType d'emploi : Temps plein",
    "job_url": "https://ma.indeed.com/rc/clk?jk=5eae3dc9219a7a1b&bb=Yi4yc9VkUAbgImntF7B2UAtGVP4WW5M2hv4h8e_6jo2IC0K0eSYhpzOyiWv9YgPqxySQ6TDeJfIPRlY70xZf8SHkJfQ5bNt6Y8j69o814p8Nn1r6WoeExSLSE0Z4rNBO0P54prNm7kXQy9ngIje42tbzJmnjxXMx&xkcb=SoBF67M3qzXb-hzNkp0IbzkdCdPP&fccid=941c1eb24f109b88&cmp=Metaverse&ti=Data+Scientist&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "Société Centrale de Réassurance: Offres de Stages PFE 2025",
    "company": "",
    "location": "Casablanca",
    "description": "Description emploi\nDans le cadre de la campagne de stages PFE 2025, la Société Centrale de Réassurance invite les étudiants ambitieux et motivés à intégrer une équipe dynamique et contribuer à des projets de grande envergure. Cette opportunité unique permet de développer des compétences clés tout en travaillant sur des thématiques passionnantes liées aux enjeux actuels.\nEntreprise de référence dans le domaine de la réassurance, la Société Centrale de Réassurance se distingue par son engagement envers l’innovation, la digitalisation et la gestion des risques. En rejoignant ses équipes, les stagiaires bénéficieront d’un encadrement professionnel dans un environnement stimulant et tourné vers l’excellence.\nLes stages proposés couvrent une variété de domaines stratégiques:\nActuariat et Modélisation des Risques\nData Science, IT et Digitalisation\nHydrogéologie et Risques Catastrophiques\nRessources Humaines\nMarketing\nFinance et Contrôle de Gestion\nProfil recherché\nLes candidatures sont ouvertes aux étudiants en fin de cycle, inscrits dans une école d’ingénieurs, une école de commerce ou une université, et souhaitant réaliser leur projet de fin d’études dans l’un des domaines cités ci-dessus.\nQualités attendues:\nEsprit créatif et capacité à proposer des solutions innovantes.\nRéactivité, organisation et autonomie.\nAptitudes analytiques et méthodologie dans la résolution de problèmes.\nExcellentes compétences en communication et en écoute.\nAvantages et perspectives\nRémunération attractive tout au long du stage.\nUne expérience enrichissante avec des projets concrets à fort impact.\nLa possibilité de signer un contrat à la fin du stage, en fonction des performances et de l’adéquation avec les besoins de l’entreprise.\nEn intégrant la Société Centrale de Réassurance, les stagiaires auront l’opportunité d’acquérir une expérience précieuse dans un environnement professionnel de haut niveau, tout en contribuant activement au succès de projets stratégiques.\n\nFinances & Assurances\nStage\n10 mois avant\nCasablanca",
    "job_url": "https://ma.indeed.com/rc/clk?jk=843ecb495d6c416a&bb=Yi4yc9VkUAbgImntF7B2UHzrj401ez77v6Y5WmoyzdDslcORFu4eSGoTksTUAot3pwNNzn3OT3rOdqfBtWU6MrkYnVb6yBRN1vTON-7F2X8yo90vPurIgpP5evpFYb5KriMmvrvdvmSrT0PQKyz5vBYeQ4OhJVon&xkcb=SoDL67M3qzXb-hzNkp0PbzkdCdPP&fccid=dd616958bd9ddc12&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=843ecb495d6c416a&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=bcdf19af61e4d248&assa=7339",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "Stage PFE – Développeur IA (Web & Mobile)",
    "company": "MAJJANE AGENCY",
    "location": "Rabat",
    "description": "Description du poste :\nMajjane, agence web et communication digitale basée à Rabat, recrute un(e) stagiaire PFE (Bac+5) en Intelligence Artificielle appliquée au développement web & mobile.\nTu intégreras une équipe passionnée par l’innovation et la technologie, et tu participeras activement à la création de fonctionnalités intelligentes intégrées dans des sites web et applications mobiles sur mesure.\nMissions principales :\nDévelopper et intégrer des modules IA dans des plateformes web et mobiles (Laravel, Flutter, React, etc.)\nExploiter et connecter des API d’intelligence artificielle (OpenAI, Google Cloud AI, Hugging Face, etc.)\nParticiper à la création de chatbots, assistants virtuels et fonctionnalités prédictives.\nCollaborer avec les équipes de design et de développement pour améliorer l’expérience utilisateur grâce à l’IA.\nEffectuer une veille technologique sur les dernières innovations en IA appliquées au web et mobile.\nProfil recherché :\nÉtudiant(e) en Bac+5 (école d’ingénieurs / université) en informatique, IA, data science ou développement web & mobile.\nBonnes connaissances en développement web (PHP / Laravel, JavaScript, React, Node.js) et/ou mobile (Flutter, Kotlin, Swift).\nIntérêt marqué pour l’IA appliquée et l’automatisation.\nNotions de Python, machine learning ou intégration d’API IA appréciées.\nConnaissances des API REST, des architectures front/back, et des flux CI/CD.\nCuriosité, rigueur, autonomie et esprit d’équipe.\nCe que nous offrons :\nEncadrement technique & méthodologique par des ingénieurs expérimentés.\nProjet PFE structuré et valorisable (code, doc, démonstrations).\nEnvironnement stimulant, orienté projets réels (clients Maroc & international).\nPour postuler :\nEnvoyez votre CV à rh@majjane.ma avec l’objet «Stage – Développement IA Web & Mobile»\nType d'emploi : Temps plein",
    "job_url": "https://ma.indeed.com/rc/clk?jk=fa473351d6af93eb&bb=Yi4yc9VkUAbgImntF7B2UH0559O1E9k_olVLWruAiAhrl24vKk5BPmUQwSK74bJicXgRPEyg_gWxgZvvi7eIUZEthtmTvUM3Lh1bZZftsIoEG4VqaxTFBPm2j_VsJ3ZFxkvS7Jf4rLzAXKeul6ij_n-SJNe4jW03&xkcb=SoB_67M3qzXb-hzNkp0ObzkdCdPP&fccid=d7fe37abf462aefd&cmp=MAJJANE-AGENCY&ti=Stagiaire+D%C3%A9veloppeur+Web&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "Stage ingénieur",
    "company": "Acti-sens",
    "location": "Kénitra",
    "description": "Entreprise\nActi-Sens est un laboratoire innovant qui explore les interactions entre charge cognitive, prise de décision, et motivation à l’aide de signaux EEG/NIRS et de données comportementales. L’équipe actuelle de stagiaires travaille sur l’analyse de ces signaux via des modèles classiques (SVM, Random Forest…) et profonds (GRU, BiLSTM), avec un fort accent sur l’explicabilité (SHAP) et la reproductibilité scientifique.\nNous collaborons également avec des chercheurs en France et en Italie (Université Paris Nanterre, Université de Padoue) sur des paradigmes cognitifs complexes comme l’apprentissage inversé probabiliste, en situation de double tâche.\nPoste\nEn collaboration avec les membres actuels (profil ingénieur, cognitive science, dev fullstack), vous contribuerez à :\nL’analyse avancée de données EEG/NIRS (prétraitement, extraction de features, fusion multimodale)\nL’expérimentation de modèles hybrides IA pour la prédiction de la charge cognitive et la classification des profils utilisateurs\nLa rédaction d’articles scientifiques (IEEE/Sensors/Frontiers…) en collaboration avec les autres stagiaires\nLa mise en place d’outils collaboratifs (GitHub, ClickUp, Notion) pour le suivi et la transparence des résultats\nLe prototypage éventuel d’une interface web de visualisation (Streamlit ou Dash)\nProfil\nÉtudiant·e en dernière année de cycle ingénieur (informatique, data science, bioinfo, IA ou équivalent)\nAu moins une publication scientifique acceptée dans un journal à comité de lecture, à joindre au CV\nSolide maîtrise de Python (numpy, pandas, scikit-learn, pytorch ou tensorflow)\nExpérience en traitement de signaux (EEG/NIRS ou capteurs physiologiques) appréciée\nAisance avec les outils collaboratifs et autonomie dans le travail en équipe\nIntérêt fort pour la recherche appliquée, les interfaces cerveau-ordinateur et les approches explicables en IA\nLes + de ce stage :\nEncadrement académique rigoureux et possibilité de co-signature sur publications scientifiques\nIntégration dans une équipe jeune, bienveillante et multidisciplinaire\nAccès à des données exclusives et des outils d’analyse avancés (Matlab, EEGLab, Python, EDFBrowser, Homer3, etc.)\nParticipation active à la conception de protocoles expérimentaux et à leur analyse\nSuivi agile : réunions régulières, suivi sur ClickUp, documentation partagée\nLocaux agréables à Kénitra, ambiance conviviale",
    "job_url": "https://ma.indeed.com/rc/clk?jk=7e5a35f5fddaf957&bb=Yi4yc9VkUAbgImntF7B2UFcOF6_8SkZk5QgeEnwMytspRZftK7VOnkrI3YkDuoQ5xZbIaSsG6XuvUzwqy-jRba5HGP6HirdGVP2uuX7O5QHwFNv8QCIRw3dG6q0u7v8eoWq5d9l9RvU3XsfLarKij70DxEgRllKM&xkcb=SoDi67M3qzXb-hzNkp0NbzkdCdPP&fccid=2cc2f834b0d5fed9&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=7e5a35f5fddaf957&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=7e8d690f4bdb1c7a&assa=4706",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "Data Scientist / Ingénieur IA Confirmé (3 à 6 ans d’expérience) – 100 % Remote",
    "company": "AdmitEase",
    "location": "Rabat",
    "description": "À propos de Talio Talent\nTalio Talent est une startup française qui connecte les talents tech d’Afrique et du Moyen-Orient avec des startups et scale-ups européennes à la recherche de profils confirmés pour des missions à distance.\nNotre mission : révéler le potentiel des talents francophones en leur offrant des opportunités internationales 100 % remote, tout en aidant les entreprises à accélérer leur croissance grâce à des profils techniques expérimentés, coachés et accompagnés.\nDescription du poste\nRejoins une startup française innovante et contribue à des projets concrets autour de la data science, de l’intelligence artificielle et de l’automatisation.\nEn tant que Data Scientist / Ingénieur IA confirmé(e), tu participeras activement à la conception, au développement et au déploiement de solutions data-driven pour des startups françaises et européennes.\nTes missions\nConcevoir et implémenter des modèles de Machine Learning et Deep Learning pour répondre à des problématiques métiers variées (prédiction, classification, NLP, computer vision, etc.)\nConstruire et maintenir des pipelines de données robustes et scalables\nAutomatiser les processus d’analyse et de reporting via des outils et frameworks modernes\nCollaborer avec les équipes produit et tech pour définir les besoins et transformer les insights en solutions concrètes\nAssurer la qualité, la traçabilité et la sécurité des données\nEncadrer ou accompagner des profils juniors lorsque nécessaire\nEffectuer une veille active sur les avancées en IA, LLMs, MLOps et Data Engineering\nProfil recherché\nDiplôme d’ingénieur ou Master (Bac+5) en Data Science, IA, informatique ou ingénierie\n3 à 6 ans d’expérience professionnelle en data science, machine learning ou ingénierie de données\nExcellente maîtrise de Python et de ses principales librairies data (Pandas, NumPy, Scikit-learn, TensorFlow, PyTorch, etc.)\nSolides compétences en bases de données (SQL / NoSQL) et en déploiement de modèles (API, Docker, cloud, etc.)\nBonne compréhension des enjeux business et capacité à vulgariser les résultats\nAutonomie, esprit analytique, rigueur et goût pour le travail collaboratif à distance\nCe que nous offrons\nProjets à fort impact dans des environnements innovants (startups, scale-ups, SaaS, fintech, healthtech, etc.)\nExpérience internationale et possibilité de collaborer avec des équipes multiculturelles\nMission 100 % remote avec flexibilité et autonomie\nAccompagnement personnalisé (coaching technique, suivi de mission, communauté d’experts)\nRémunération compétitive, selon expérience et expertise\nType de contrat\nCDI, CDD ou mission freelance – temps plein / remote\nType d'emploi : CDI, CDD, Profession libérale, Stage, Apprentissage / Alternance\nDurée du contrat : 6 mois\nRémunération : à partir de 5.000,00DH par mois",
    "job_url": "https://ma.indeed.com/rc/clk?jk=b07fff5fe91b3b71&bb=Yi4yc9VkUAbgImntF7B2UHKCZ5ilROASjgbfAJ4UmfCjwSejnstj7_XPTQja_9qRsA9cRX_gvPcPd1yyHzTDd11lDedMonUSAzHGtHzGfbwyM2E4Vs8NKTw9uDB15LV2qp52ROJ0M0QsQcZ_ErmNUkK8iHPEoahW&xkcb=SoBW67M3qzXb-hzNkp0MbzkdCdPP&fccid=85205e3b730b299a&cmp=AdmitEase&ti=Data+Scientist&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "Stage Dev Python",
    "company": "SAHAM BANK (EX SOCIÉTÉ GÉNÉRALE MAROC)",
    "location": "Casablanca",
    "description": "SAHAM BANK (EX SOCIÉTÉ GÉNÉRALE MAROC)\nCasablanca\nStage\nSur site\nil y a 1 semaine(s)\n\nReference 25000OAE\nResponsibilities\nVous intégrerez l’équipe Trading Process Factory au sein de SG ATS, spécialisée dans l’automatisation des processus métiers et l’innovation technologique, notamment autour du développement Python et de l’intelligence artificielle appliquée aux marchés financiers.\nEncadré(e) par un référent technique, vos principales missions seront :\nDévelopper et maintenir des outils d’automatisation et d’optimisation des processus de trading et de gestion des risques, principalement en Python.\nParticiper à l’implémentation de solutions basées sur l’intelligence artificielle pour améliorer l’analyse des indicateurs de marché, la détection d’anomalies, et l’aide à la décision.\nCollaborer avec les équipes métiers pour comprendre leurs besoins, analyser les problématiques opérationnelles et proposer des améliorations technologiques innovantes.\nContribuer à la documentation technique et fonctionnelle des développements réalisés.\nAssurer la qualité, la robustesse et la performance des outils développés dans un environnement réglementé.\nProfile Required\nVous êtes étudiant(e) en Master, Grande École d’Ingénieurs ou 3e cycle universitaire avec une spécialisation en finance de marché, informatique ou data science.\nVous avez une forte appétence pour le développement logiciel, notamment en Python, ainsi qu’un intérêt marqué pour l’intelligence artificielle et ses applications dans la finance.\nVous êtes motivé(e) par les environnements internationaux et les enjeux liés à l’automatisation, la digitalisation des processus et la gestion des risques financiers.\nCompétences requises\nTechniques:\nMaîtrise avancée de Python, avec une expérience en développement d’outils d’automatisation.\nConnaissances en intelligence artificielle / machine learning appliquées à la finance (un plus).\nFonctionnelles :\nCompréhension des processus de trading et de gestion des risques.\nCapacité à analyser des besoins métiers et à proposer des solutions techniques adaptées.\nSoft Skills:\nAutonomie, rigueur et sens de l’initiative.\nEsprit d’équipe et bon relationnel.\nCapacité à documenter clairement les travaux réalisés.\nN’hésitez pas à postuler pour rejoindre une équipe dynamique où technologie et finance de marché se conjuguent pour relever les défis de demain.\nBusiness insight\nFiliale du Groupe Société Générale, Société Générale Africa Technologies and Services (SG ATS) a été créée en 2014 pour fournir des solutions agiles et innovantes aux salles des marchés de la banque en Europe (principalement Paris et Londres). SG ATS accompagne le développement des activités de marché en répondant aux exigences croissantes des réglementations bancaires internationales. Fort de son succès, SG ATS vise à devenir un centre multi-services à forte valeur ajoutée, intervenant auprès de plusieurs lignes métiers du Groupe (Europe, États-Unis, Asie) sur des activités de marchés, ainsi qu’auprès des directions des risques, financière, conformité et autres directions centrales.\n« Les informations recueillies sur ce site font l’objet d’un traitement destiné à répondre aux besoins de recrutement de la société SG ATS. Ces données sont traitées par les services internes de la société. Conformément à la loi n° 09-08 promulguée par le Dahir 1-09-15 du 18 février 2009, relative à la protection des personnes physiques à l’égard du traitement des données à caractère personnel, vous bénéficiez d’un droit d’accès et de rectification aux informations qui vous concernent, que vous pouvez exercer. Vous pouvez également, pour des motifs légitimes, vous opposer à ce que les données qui vous concernent fassent l’objet d’un traitement. Ces données peuvent faire l’objet d’un transfert à l’étranger. Ces traitements ont été notifiés et autorisés par la CNDP sous les numéros A-RH-354/2016 et T-RH-129/2016.\nDiversity and Inclusion\nWe are an equal opportunities employer and we are proud to make diversity a strength for our company. Societe Generale is committed to recognizing and promoting all talents, regardless of their beliefs, age, disability, ethnic origin, nationality, membership of a political, religious, trade union or minority organisation, or any other characteristic that could be subject to discrimination.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=771116d1a8a09cb9&bb=Yi4yc9VkUAbgImntF7B2UEz0dXJQUPNOSsQ3Lm8-y4FlIfHDpRwW4lXOQbdKzlKA3zq33mXIUyRr1IhMLjv44NJrFEaToAXi72AAFU1qQzfwMWGXdWVV6Bi3-kwLnTzP4t_fAmdZ8qML0h5rAqc-tnxw8KXu38Y9&xkcb=SoC_67M3qzXb-hzNkp0DbzkdCdPP&fccid=eb1a50b324aa6243&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=771116d1a8a09cb9&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=f21e9109db9ab98c&assa=2152",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "Opportunité de Stage – Développeur Full Stack & IA – Rémunéré",
    "company": "SMILYCALL",
    "location": "Marrakech",
    "description": "SMILYCALL\nMarrakech\nStage\nHybride\nil y a 1 moi(s)\n\nSmilycall le leader du télésecrétariat qui révolutionne l’accompagnement administratif grâce à la digitalisation et l’intelligence artificielle.\nNous recherchons un talent d’exception.\nUn(e) Développeur(se) Full Stack passionné(e) par l’IA et l’automatisation, prêt(e) à relever un vrai défi : construire des solutions digitales innovantes qui transforment radicalement la manière dont nous gérons les services de télésecrétariat.\nCe stage n’est pas un simple projet de fin d’études — c’est une immersion dans une entreprise visionnaire où tu développeras des outils concrets, intégreras l’IA pour automatiser des processus complexes, et participeras à la transformation digitale d’un secteur entier.\nProfil recherché\nIngénieur ou Master en Informatique / Génie Logiciel / Data Science (Bac+5)\nMaîtrise du développement Full Stack (Front-end + Back-end)\nNotions solides en Intelligence Artificielle et Machine Learning\nPassionné(e) par l’automatisation, les API et l’innovation technologique\nCapable de transformer un besoin métier en solution technique élégante\nEsprit analytique, créatif et orienté résolution de problèmes\nAutonome, rigoureux(se) et avide d’apprendre\nTes futures missions\nDéveloppement & Digitalisation\nConcevoir et développer des applications web pour digitaliser nos processus de télésecrétariat\nCréer des interfaces utilisateurs intuitives et performantes (dashboards, CRM, outils de gestion)\nDévelopper des API robustes pour connecter nos différents systèmes\nOptimiser et maintenir notre infrastructure technique\nIA & Automatisation\nIntégrer des solutions d’IA pour automatiser des tâches répétitives (traitement d’emails, classification de documents, chatbots)\nDévelopper des systèmes de reconnaissance vocale et de transcription automatique\nImplémenter des outils d’analyse de données et de prédiction\nCréer des workflows intelligents pour améliorer l’efficacité opérationnelle\nInnovation Continue\nFaire de la veille technologique sur les nouvelles solutions IA/automatisation\nProposer et prototyper des innovations qui donnent un avantage concurrentiel\nParticiper à l’architecture et à la stratégie technique de l’entreprise\nStack technique recherchée\nFront-end :\nJavaScript / TypeScript (React, Svelte)\nHTML5, CSS3, Tailwind CSS\nResponsive Design & UX/UI\nBack-end :\nNode.js, Python\nAPIs REST\nBases de données (MySQL, PostgreSQL, MongoDB)\nIA & Automatisation :\nPython (TensorFlow, PyTorch, scikit-learn)\nAPIs IA (OpenAI, Google Cloud AI)\nAutomatisation ( n8n)\nNLP (Natural Language Processing)\nConditions\nLieu : Marrakech + télétravail partiel\nRémunération : Attractive + primes sur objectifs\nDurée : 2 a 6 mois (stage pré-embauche)\nCDI garanti à l’issue du stage pour les profils performants\nPourquoi nous rejoindre ?\nParce que tu ne coderas pas “juste pour coder”, mais pour créer des solutions qui ont un impact réel et immédiat.\nIci, tu auras :\nL’autonomie de proposer et implémenter tes propres idées\nL’impact direct sur la croissance de l’entreprise\nL’apprentissage continu avec des technologies de pointe (IA, automatisation)\nLa reconnaissance : ton talent sera valorisé et récompensé par un CDI\nTu ne seras pas un développeur parmi d’autres — tu seras l’architecte de notre transformation digitale.\nCandidature :\nEnvoie ton CV + Portfolio GitHub (projets, repos, contributions) à :\nObjet : “Développeur Full Stack & IA – [Ton Prénom]”\nBonus : Un projet personnel en IA/automatisation ou un lien vers une démo de tes réalisations.\nSeuls les profils les plus prometteurs seront contactés pour un entretien technique.\nNous recherchons l’excellence, pas la moyenne. Si tu es prêt(e) à construire l’avenir du télésecrétariat avec la tech et l’IA, cette opportunité est pour toi.\nType d’emploi : Temps plein, Stage\nDurée du contrat : 6 mois",
    "job_url": "https://ma.indeed.com/rc/clk?jk=8433f35dc3c35c49&bb=Yi4yc9VkUAbgImntF7B2UKFuBNvo5Vgg6g3_Z5ec01a9DgaUvCIplKw6-wvRC92urYiP6fovbQsB1i-OSj8hDVsDYmedYf4sn2nETGqYEJmlnhgyky8p2Te2SsOfv7USYyFKd4ujnIaw8bWc6HZQuFRfj94hpdpr&xkcb=SoAL67M3qzXb-hzNkp0CbzkdCdPP&fccid=e7fba0f396b07df8&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=8433f35dc3c35c49&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=41f42e3042e5c685&assa=6066",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "",
    "company": "",
    "location": "",
    "description": "",
    "job_url": "https://ma.indeed.com/viewjob?jk=0f1e2d3c4b5a6978",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "Stage/PFE Ingénieur IA & Automatisation – NLP & optimisation pour un SaaS",
    "company": "PIONOVAAI",
    "location": "Maroc",
    "description": "PIONOVAAI\nMaroc\nStage\nÀ distance\nil y a 1 semaine(s)\n\nPionovaAI est une startup marocaine spécialisée dans l’automatisation intelligente des processus métier grâce à l’IA.\nNous développons un SaaS innovant destiné à optimiser et digitaliser les opérations métiers.\n– Missions principales:\nDévelopper des fonctionnalités IA appliquées au produit\nTravailler sur l’analyse, le résumé automatique et le traitement des données\nMettre en place des algorithmes d’optimisation et de recommandations\nContribuer à l’intelligence globale du SaaS\n– Profil recherché:\nÉtudiant(e) en 5e année IA / Data Science\nMaîtrise du Python et des bases du NLP / ML\nMotivation, curiosité et autonomie\nBonus : projets personnels en IA ou optimisation\n– Avantages:\nApplication concrète de l’IA\nMentorat direct avec le fondateur\nPortfolio fort avec un vrai MVP IA\nForte probabilité d’embauche\n– Informations:\nStage / PFE – 4 à 6 mois\n100 % télétravail (le projet étant piloté depuis la France, nous fonctionnons entièrement à distance avec des outils collaboratifs très efficaces)\nDébut : Janvier – Février 2026",
    "job_url": "https://ma.indeed.com/rc/clk?jk=4cffc02e663f7c43&bb=Yi4yc9VkUAbgImntF7B2UIEUjJxHRGLr-_ClJmQ4E3GJz_3konA51PPgO64UCqAw_gAczv5E6LRkbgRsRWU_KCZZMUHolmZCDvlagvW7ab9PxjW0Izir9rcEhEl_6J--PTH_L9MxS4UnuO-Y5BP60zjv6AKNYG50&xkcb=SoCW67M3qzXb-hzNkp0BbzkdCdPP&fccid=ebb2b7acb20f2f19&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=4cffc02e663f7c43&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=7cd6eba17645e949&assa=4365",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "Stagiaire Datalab",
    "company": "COFACE",
    "location": "Casablanca",
    "description": "COFACE\nCasablanca\nStage\nHybride\nil y a 1 moi(s)\n\nDescription de l’entreprise\nChez Coface, nous faisons avancer le commerce chaque jour.\nNos 5 200 experts, représentant plus de 80 nationalités dans 58 pays, sont unis par une mission commune : aider les entreprises à naviguer dans l’incertitude en leur donnant les moyens de prendre les bonnes décisions et de commercer plus intelligemment dans un monde complexe.\nAvec près de 80 ans d’expérience internationale, nous proposons aux entreprises une gamme complète de solutions : assurance-crédit, informations d’entreprise, recouvrement de créances, assurance risque unique, cautions, affacturage — le tout porté par un patrimoine de données unique, une technologie de pointe, de l’innovation et une compréhension approfondie de l’économie mondiale.\nRejoindre Coface, c’est intégrer une organisation internationale soudée, où vos idées comptent. Nous cultivons une culture d’apprentissage, de collaboration et d’inclusion, où vous avez des responsabilités et pouvez constater l’impact de vos actions.\nFaçonnez l’avenir du commerce avec nous.\nRejoignez les Happeners !\nDescription du poste\nNotre DataLab est à la recherche de stagiaires passionnés par la donnée, curieux et motivés pour apprendre et contribuer à des projets innovants autour de l’intelligence artificielle, du machine learning et de l’analyse de données.\nMissions :\nVous intégrez l’équipe de Data Lab de Coface et travaillez le plus souvent en binôme ou dans des équipes réduites sur des projets innovants\nVous concevez et développez complètement des solutions pouvant mettre en œuvre des technologies de Machine Learning, jusqu’au déploiement sur nos infrastructures de containers ou dans le cloud, et au monitoring en production\nVous contribuez à la veille technologique\nQualifications\nFormation d’Ingénieur ou équivalent en Data Science\nMaîtrise des modèles d’apprentissage supervisé et non-supervisé, clustering, NLP…\nMaîtrise de Python, son écosystème et des bonnes pratiques\nAutonomie, curiosité, rigueur\nAnglais : projets dans des contextes internationaux\nCompétences appréciées :\nUtilisation de Linux et Git\nExpérience en développement d’application Python avec des standards de qualité élevés\nMise en œuvre de chaîne CI/CD\nExpérience de déploiement Docker/Kubernetes et d’application dans le cloud\nPratique de SQL et expérience en bases NoSQL (document, graph)",
    "job_url": "https://ma.indeed.com/rc/clk?jk=93d147db4744809a&bb=Yi4yc9VkUAbgImntF7B2UFz9IL8tx-8w6Muo2zSrkwo7n0NElRGwRoY5jDbrNMyJghBhX_H4McL5bSoDlTlJgLHr17eEOX1PESJuIrJhdiTnJD8k9V2yGBQwanEgQDttTktI5lX1y19hNGEB8bHuEpvRBaMLghY5&xkcb=SoAi67M3qzXb-hzNkp0AbzkdCdPP&fccid=75f93e975afa917b&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=93d147db4744809a&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=e342aa3164f50909&assa=8739",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "PFE DET 2026",
    "company": "Expleo",
    "location": "Tanger",
    "description": "Description du poste:\nGroupe EXPLEO, plus qu’une histoire, une aventure humaine…\nLe Groupe EXPLEO s’appuie sur 19000 collaborateurs hautement qualifiés qui fournissent des solutions à forte valeur ajoutée dans 30 pays. Expleo vous aide à réaliser vos ambitions et à assurer, ensemble, votre avenir. Nous vous offrons un mélange unique de réflexion audacieuse et d’exécution fiable, pour accélérer l’innovation à travers chaque étape de votre chaîne de valeur.\nAu-delà de rejoindre une entreprise, c’est donc une aventure humaine que nous vous proposons de VIVRE !!#LI-SH1\nMissions:\nNous recherchons plusieurs stagiaires PFE pour rejoindre notre département Digital, au sein d’une équipe engagée dans le développement de solutions innovantes orientées Data, Intelligence Artificielle et Transformation digitale.\nLes stagiaires seront intégrés au cœur de nos projets numériques et contribueront à la conception, au développement et à l’amélioration de solutions digitales à forte valeur ajoutée.\n\nUn encadrant technique vous accompagnera tout au long du stage pour assurer une montée en compétence progressive et un suivi régulier\nQualifications:\nÉtudiant(e)s en dernière année en Génie Informatique, Data Engineering, Data Science, IA / Machine Learning, Systèmes d’Information, ou équivalent\nCompétences attendues (selon profil) :\nProgrammation : Python / JavaScript / SQL / autres\nData : Power BI, Pandas, ETL, Data Visualization\nIA : Machine Learning, Deep Learning, modèles supervisés / non supervisés\nConnaissance de frameworks ou outils cloud (atout)\nCuriosité, autonomie et esprit d’initiative\nBon niveau de communication en Français/ Anglais",
    "job_url": "https://ma.indeed.com/rc/clk?jk=22c74ee34feb5d65&bb=Yi4yc9VkUAbgImntF7B2UG7B7y5O3hcUzafnkQIBjCc_gclDBShmT0S1KIJnYb_WRM6bDCutqfwZ3z8A4i26PEsULSP4wvJ44QgJLeLz5SWpi2UpiyYdySmDVZ1rLfRKjFqPtQFdrz8e_xiToBvWzWzG3GgdBjtK&xkcb=SoCs67M3qzXb-hzNkp0HbzkdCdPP&fccid=8f5cb52d4dd4f2ad&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=22c74ee34feb5d65&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=6adebad994786b7d&assa=3158",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "Automotive Engineering - Supply Chain - Stagiaires F/H",
    "company": "Renault Group",
    "location": "Tanger",
    "description": "Société\nRenault Tanger Exploit\nDescriptif du poste\nContexte:\nRenault Tanger Exploitation offre des stages de fin d’études 2026 destinés aux étudiants souhaitant participer au développement d’applications innovantes pour optimiser les flux, améliorer la performance logistique et digitaliser les processus industriels. Ces stages permettent de contribuer à des projets stratégiques visant à rendre la supply chain plus agile, réactive et connectée, en s’appuyant sur les technologies numériques et l’analyse de données.\n\nProfils recherchés :\nEtudiants Bac +3 à Bac +5 en :\nGénie Industriel &Logistique\nDéveloppeur IA / Chatbot Engineer\nIngénieur Supply Chain / Qualité Fournisseurs\nData Science / Informatique décisionnelle\nManagement industriel\nData Analyst\nIngénieur Supply Chain\nDéveloppeur IA\nData Engineer\n\nCompétences souhaitées :\nAnalyse et optimisation des processus logistiques et industriels .\nConception et suivi de tableaux de bord, indicateurs de performance (KPI) .\nDigitalisation et automatisation de processus .\nGestion de projets et planification opérationnelle .\nMaitrise des outils numériques et bases de données .\nMétier\nFabrication\nDurée du contrat\n6 months\nRenault Group s’engage à créer un environnement de travail inclusif et les conditions permettant à chacun de nous d’apporter sa passion, donner le meilleur de lui-même et s’épanouir, tout en étant lui-même.\n\nNous trouvons notre force dans notre diversité et nous nous engageons à garantir l'égalité des chances en matière d'emploi, indépendamment de la couleur, de l'ascendance, de la religion, du sexe, de l'origine nationale, de l'orientation sexuelle, de l'âge, de la citoyenneté, de l'état civil, du handicap, de l’identité de genre, etc. Si vous avez un handicap ou un besoin particulier nécessitant l’aménagement du poste de travail ou de l’horaire de travail, merci de nous le faire savoir en remplissant ce formulaire.\nAfin de pouvoir suivre en temps réel l'évolution de vos candidatures et pouvoir rester en contact avec nous, nous vous invitons à créer un compte candidat. Cela ne vous prendra pas plus d’une minute et vous permettra également de faciliter vos prochaines candidatures.\n\nEn soumettant votre CV ou votre candidature, vous autorisez Renault Group à utiliser et stocker des informations vous concernant à des fins de suivi de votre candidature ou de futurs emplois. Ces informations ne seront utilisées que par les sociétés de Renault Group tel que mentionné dans la\nPolitique Groupe de protection des données personnelles\n.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=abafc0ec741d2ab0&bb=Yi4yc9VkUAbgImntF7B2UHxwGRBdbOCIQltjl597lmr4Ki4gmvHn7Kag78WmaHYd6eo_vUktlzewWs7OjCl9yKiB_lmBbkNpRSXPTsoo5cvzZOYlVm129P8VPAh5oAhiOvZgnTW9om_g2XYHHLEPmwTOQoMN1l1X&xkcb=SoAY67M3qzXb-hzNkp0GbzkdCdPP&fccid=d87a03e3623e180d&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=abafc0ec741d2ab0&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=7312e0c24bcc64b3&assa=6607",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage data science",
    "title": "Consulting Manager – Strategy & Transformation",
    "company": "Artefact",
    "location": "Casablanca",
    "description": "Qui sommes-nous ?\nArtefact est une société internationale de conseil en services data et IA, dont le siège est à Paris, qui depuis 10 ans est spécialisée dans la conception et le déploiement de technologies d'intelligence artificielle et de solutions data-driven, dont la mission est d'accélérer l'adoption de l'IA pour un impact positif sur les individus et les organisations.\nPionnière dans son domaine, à partir des données et de technologies avancées d'intelligence artificielle, les équipes de consultants métiers et d'ingénieurs travaillent ensemble pour développer des solutions qui créent de l'impact business et améliorent la productivité sur l'ensemble de la chaîne de valeur des entreprises, et ce dans le respect d'un usage éthique et responsable de la data.\nAlliant le meilleur de l'expertise technologique et de l'excellence opérationnelle, Artefact accompagne plus de 1000 sociétés dans le monde pour accélérer leur transformation business, dont plus de 300 entreprises internationales telles qu'Orange, Samsung, L'Oréal ou encore Sanofi. Ses 1700 experts répartis dans 27 bureaux à travers le monde, interviennent dans tous les secteurs clés de l'économie : industrie, retail, luxe, grande consommation, santé, finance, etc…\nEn tant que Stagiaire Data Consultant, tu seras pleinement intégré(e) à une équipe de consultants. Ton rôle sera d'assister nos clients dans l'élaboration et la mise en œuvre de leur stratégie data, de la phase d'idéation jusqu'à l'implémentation. Tes missions pourront inclure :\nCadrage / gestion des projets : interview clients et partenaires, mise en place de workshops, préparation des uses cases…\nConstruction de roadmaps, d'analyses data-driven avec l'équipe projet et conception d'infrastructures en collaboration avec nos experts\nOrchestration du bon déroulement du projet, en appliquant le cas échéant les méthodes agiles (sprints planning et reviews, backlog refinement, démos…)\nVeille technologique et sectorielle : rester à l'affût des dernières tendances en matière de data et d'intelligence artificielle pour proposer des solutions innovantes.\nCommunication : Préparer des présentations et des supports de communication pour les comités de direction et les équipes clientes.\nProcessus de recrutement\nÉtape 1 : Un entretien de fit avec un senior Data Consultant.\nÉtape 2 : Un entretien de type business case avec un premier tour avec un senior ou un manager Data Consultant. Le but de cet entretien est de tester vos méthodes et capacités déductives, votre capacité à résoudre un problème et de confirmer votre intérêt pour Artefact (1 heure)\nProfil recherché\nFormation : tu es étudiant(e) en dernière année de cycle ingénieur ou au sein d'une grand école de commerce avec une spécialisation en Data, Conseil, ou Management de l'Innovation et tu recherches ton stage de fin d'études à partir de Janvier 2026\nCompétences :\nFort intérêt pour la Data Science et les technologies de la donnée. Tu n'es pas nécessairement un(e) expert(e) technique, mais tu comprends les concepts clés du machine learning, de la Business Intelligence, et du Big Data.\nExcellentes compétences analytiques et de synthèse.\nMaîtrise avancée de la suite Microsoft Office (en particulier PowerPoint et Excel).\nUne connaissance de SQL ou d'un outil de visualisation de données (Power BI, Tableau) est un plus.\nQualités personnelles :\nSens de la communication et du relationnel : Tu es capable de t'exprimer clairement et de t'adapter à différents interlocuteurs.\nProactivité et autonomie : Tu es force de proposition et prends des initiatives.\nRigueur et organisation : Tu es capable de gérer plusieurs tâches et de respecter les délais.\nFrançais courant pour travailler en équipe et anglais professionnel obligatoire pour nos clients internationaux\nCe que nous offrons\nUn stage de 6 mois basé à Casablanca.\nUn environnement de travail stimulant au sein d'une équipe dynamique et experte.\nL'opportunité de travailler sur des projets concrets avec des entreprises de premier plan.\nLa possibilité d'être embauché(e) en CDI à la fin du stage.\nSi tu es passionné(e) par la data et que tu souhaites développer une double compétence en conseil et en technologie, envoie-nous ta candidature !",
    "job_url": "https://ma.indeed.com/rc/clk?jk=4f36dd228eae80af&bb=Yi4yc9VkUAbgImntF7B2UPw1mP6Efb4S9j2HwYhj5Y6kgp6rK_RSp6talGRDkXip-MkDfDmb0xZ9jx84AP_W9taeAa37TIz9c3UXe0JgPmkK60qlmoGRGHG207leJWoQ7BuwIWqBWblat0s4MaILoJJyWOMgq1d6&xkcb=SoCF67M3qzXb-hzNkp0FbzkdCdPP&fccid=c1f750eaef1d79c4&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=4f36dd228eae80af&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=bb5afd92661ecc4d&assa=992",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Stagiaire PFE DATA / IA / BI (H/F)",
    "company": "Deloitte",
    "location": "Maroc",
    "description": "\" Tous nos postes sont ouverts au télétravail.?\"\nRejoindre Deloitte, c'est dire oui à une expérience qui a du sens, celle où les rencontres et les missions vous poussent à grandir chaque jour. C’est évoluer dans un environnement de travail fondé sur la confiance, la transmission et l’intelligence collective pour construire l’avenir de nos clients. Un avenir que nous voulons plus responsable, plus durable et respectueux de l’environnement en prenant des initiatives concrètes à notre échelle. Nous rejoindre, c’est aussi dire oui à une entreprise Great Place to Work , attachée au bien-être, et à l’inclusion sans distinction de nos collaborateurs.?\nEt vous, prêts à dire? #ISayYes à votre futur chez Deloitte ??\nDeloitte Extended Services , basé à Casablanca est une filiale à 100% de Deloitte France et constitue un centre de responsabilité à part entière.\nEn support de différentes member firmes, Deloitte Extended Services mobilise ses talents au service de clients de toutes tailles et de tous secteurs, couvrant une large palette d'offres : Audit et Risk Advisory, Consulting, juridique & fiscal et fonctions supports. Notre Delivery Center se positionne également comme un centre d'expertises en matière de nouvelles technologies au Maroc ainsi qu'au sein du Groupe Deloitte. Nos consultants et nos experts travaillent sur des projets de grande envergure, avec une diversité de missions et de secteurs à l’échelle internationale.\nQuel sera votre rôle?dans la #TeamDeloitte ?\nAu sein de l’équipe Learning & Development (L&D) de Deloitte Extended Services à Casablanca, nous recherchons un(e) stagiaire de fin d’études passionné(e) par la DATA, l’Intelligence Artificielle (IA) et la Business Intelligence (BI) pour accompagner la transformation digitale de nos dispositifs de formation.\nMissions principales :\nParticiper à la collecte, l’analyse et la valorisation des données liées à la formation et au développement des compétences.\nContribuer à la mise en place et à l’optimisation de dashboards et d’outils BI pour le pilotage de l’activité L&D.\nMettre en œuvre des solutions d’IA (analytics, automatisation, recommandations personnalisées) pour améliorer l’expérience apprenant et l’efficacité des parcours de formation.\nCollaborer avec les équipes internes (RH, IT, métiers) pour identifier des cas d’usage innovants.\nVeiller à la qualité, la sécurité et la conformité des données traitées.\nParticiper à des projets transverses liés à la transformation digitale de la fonction L&D.\nProfil recherché :\nÉlève ingénieur(e) en dernière année (Bac+5) d’une école d’ingénieurs (EMSI, ENSA, Centrale Casablanca, Facultés de technologie ou équivalent).\nSpécialisation ou forte appétence pour la DATA, l’IA et/ou la BI.\nCompétences techniques :\nMaîtrise d’outils de BI (Power BI, Tableau, QlikView, etc.)\nConnaissances en data analytics, machine learning, ou data engineering (Python, SQL, R ou équivalent)\nCompréhension des enjeux liés à la gestion et la sécurité des données.\nBon esprit d’analyse, rigueur, autonomie, sens de l’initiative.\nAisance relationnelle et capacité à travailler en équipe.\nBon niveau de français (écrit et oral), l’anglais est un plus.\nStage basé à Casablanca.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=2ec799d625cb1b0c&bb=7Si6sPR_aX_z7nezBeSeJzLQ3V5oPX-EKzedOAJpd4is6gua_Ryr0CzsvNwmU7tESuLLo1WXuPQHc_KUCOLl1-mQBUu7dXIl5qmX3M9sDs-uBZ2N76cVwCuB4J9XeHF0zEFzCcbYzXpA36lEbQtXlAmMEgorWxcd&xkcb=SoBl67M3qzXSRLzNdp0LbzkdCdPP&fccid=9e215d88a6b33622&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=2ec799d625cb1b0c&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=184ab1c0f21d84e9&assa=8844",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Offre de Stage – Développeur en Intelligence Artificielle (IA)",
    "company": "AI HUB",
    "location": "Rabat",
    "description": "Lieu : AI Hub / – Rabat\nDurée : 3 mois\nDébut : Dès que possible\nDescription du poste\nAI Hub propose un stage formateur pour un(e) développeur(euse) en intelligence artificielle passionné(e) par les nouvelles technologies et curieux(se) d’explorer les applications concrètes de l’IA.\nCe stage vous permettra d’acquérir une première expérience pratique au sein d’un environnement innovant et collaboratif.\nMissions principales\nParticiper à la conception et au développement de prototypes d’outils basés sur l’IA\nTravailler sur des projets en lien avec le traitement de données, l’automatisation et le machine learning\nRéaliser des tests et documenter les résultats\nAssister l’équipe technique dans la mise en place de solutions IA internes\nVeille technologique sur les tendances et outils IA\nProfil recherché\nÉtudiant(e) en informatique, data science ou domaine connexe\nConnaissance de base en Python, TensorFlow, ou PyTorch\nIntérêt marqué pour le machine learning, la data et l’automatisation\nEsprit analytique, rigoureux et curieux\nCapacité à travailler en équipe et à apprendre rapidement\nConditions\nStage rémunéré\nAttestation de stage fournie\nHoraires : du lundi au vendredi, 09h00 à 17h30 –\nCandidature\nEnvoyez votre CV à : team@hub4digi.com\nObjet : Stage – Développeur IA\nType d'emploi : Temps plein, Stage\nDurée du contrat : 3 mois\nType d'emploi : Temps plein",
    "job_url": "https://ma.indeed.com/rc/clk?jk=9ee11eddef435923&bb=7Si6sPR_aX_z7nezBeSeJyW3XXOKQth6U8OItrz9p00Q0apslAhBRMt50jJ8Q584wp5MA4X0_uzokM_7h9XJFzY-DOL464CLcVT6-yjZ7zaEfNFdYIv7C20NEv3ej7cZEpEP90XmGtRtRHeBqToZj1rpDjlt88q-&xkcb=SoDR67M3qzXSRLzNdp0KbzkdCdPP&fccid=e29cad4ea4d93ed1&cmp=AI-Hub&ti=Stage+D%C3%A9veloppeur&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Stage pré-embauche Data Engineer (GCP & Terraform) – 3 mois",
    "company": "Metaverse",
    "location": "Casablanca",
    "description": "À propos de nous :\nMetaverse est une organisation tournée vers l'avenir, engagée en faveur de l'innovation et de la technologie. Nous nous consacrons à la création de solutions de pointe qui ont un impact dans divers secteurs. Alors que nous continuons à grandir, nous recherchons des talents motivés et enthousiastes pour rejoindre notre équipe.\nAperçu du poste :\nNous recherchons un(e) Stagiaire Data Engineer (GCP) – Stage pré-embauche de 3 mois pour travailler en étroite collaboration avec notre équipe d'ingénierie des données. Ce stage offre une excellente opportunité pour les aspirant(e)s ingénieurs des données d'acquérir une expérience pratique, s’intégrer au projet client, et préparer une embauche future.\nResponsabilités principales :\nCollaborer avec les ingénieurs seniors pour concevoir, construire et maintenir des pipelines de données et des processus ETL.\nParticiper à l'intégration et à la transformation de données provenant de diverses sources.\nContribuer à l'optimisation et à l'amélioration des performances des pipelines existants.\nAider au développement et à la maintenance des entrepôts de données et bases de données.\nTravailler avec les analystes et scientifiques des données pour garantir la disponibilité et la fiabilité des données.\nDocumenter et communiquer les processus et bonnes pratiques en ingénierie des données.\nParticiper à la gestion de l’infrastructure via des outils d’infrastructure as code, notamment Terraform.\nQualifications :\nÉtudiant(e) en dernière année de Master (BAC+5) en Informatique, Data Engineering ou filière technique connexe, ou diplômé(e) récemment.\nFort intérêt pour l'ingénierie des données et les technologies associées.\nMaîtrise de Python, SQL, Google Cloud Platform (GCP), AWS, Apache Spark et Terraform (obligatoire).\nFamiliarité avec la science des données, les processus ETL, le NLP et le Machine Learning.\nBonnes compétences en résolution de problèmes et sens du détail.\nCapacités de communication et esprit d'équipe.\nModalités du stage pré-embauche :\nDurée : 3 mois\nStage d’intégration sur projet client, en vue d’une embauche éventuelle à l’issue du stage.\nPériode à discuter selon disponibilité.\nLocalisation : Casablanca, Maroc.\nComment postuler ?\nEnvoyez votre CV à recruitment@metave.us en mentionnant l’objet :\n\"Candidature – Stage pré-embauche Data Engineer\".\nInformations complémentaires :\nHoraires : Lundi - Vendredi (9h - 17h) / Samedi (9h - 13h en télétravail)\nDisponibilité : Immédiate\nType d'emploi : Temps plein (stage)\nType d'emploi : Temps plein",
    "job_url": "https://ma.indeed.com/rc/clk?jk=5eae3dc9219a7a1b&bb=7Si6sPR_aX_z7nezBeSeJ0KXkdjBefi4NUura0RK-5EC2IIGjJpqD-ovAhCWyAlDwskhD20DRjpJuHefIIA9YCBSmHmGSQiWpJRUFCoQyYjM6q3t2PWAdMHY-HPw64AoIDcUMkqBqh2273yjczfYAvHcvEKFHqlo&xkcb=SoBM67M3qzXSRLzNdp0JbzkdCdPP&fccid=941c1eb24f109b88&cmp=Metaverse&ti=Data+Scientist&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Stage PFE – Développeur IA (Web & Mobile)",
    "company": "MAJJANE AGENCY",
    "location": "Rabat",
    "description": "Description du poste :\nMajjane, agence web et communication digitale basée à Rabat, recrute un(e) stagiaire PFE (Bac+5) en Intelligence Artificielle appliquée au développement web & mobile.\nTu intégreras une équipe passionnée par l’innovation et la technologie, et tu participeras activement à la création de fonctionnalités intelligentes intégrées dans des sites web et applications mobiles sur mesure.\nMissions principales :\nDévelopper et intégrer des modules IA dans des plateformes web et mobiles (Laravel, Flutter, React, etc.)\nExploiter et connecter des API d’intelligence artificielle (OpenAI, Google Cloud AI, Hugging Face, etc.)\nParticiper à la création de chatbots, assistants virtuels et fonctionnalités prédictives.\nCollaborer avec les équipes de design et de développement pour améliorer l’expérience utilisateur grâce à l’IA.\nEffectuer une veille technologique sur les dernières innovations en IA appliquées au web et mobile.\nProfil recherché :\nÉtudiant(e) en Bac+5 (école d’ingénieurs / université) en informatique, IA, data science ou développement web & mobile.\nBonnes connaissances en développement web (PHP / Laravel, JavaScript, React, Node.js) et/ou mobile (Flutter, Kotlin, Swift).\nIntérêt marqué pour l’IA appliquée et l’automatisation.\nNotions de Python, machine learning ou intégration d’API IA appréciées.\nConnaissances des API REST, des architectures front/back, et des flux CI/CD.\nCuriosité, rigueur, autonomie et esprit d’équipe.\nCe que nous offrons :\nEncadrement technique & méthodologique par des ingénieurs expérimentés.\nProjet PFE structuré et valorisable (code, doc, démonstrations).\nEnvironnement stimulant, orienté projets réels (clients Maroc & international).\nPour postuler :\nEnvoyez votre CV à rh@majjane.ma avec l’objet «Stage – Développement IA Web & Mobile»\nType d'emploi : Temps plein",
    "job_url": "https://ma.indeed.com/rc/clk?jk=fa473351d6af93eb&bb=7Si6sPR_aX_z7nezBeSeJ8QPt1aYEAveclfqQMj_A3l_LTd_1rSJ2QY84M0LgdCHqoou3UQaOotiAyKC91cl5XtGa_L5oALPHiZIA9Af4jJe0hvtOsCnecmTjsksUXbXBBtSQQ_XJjPuIBtBGL89gg8b9N9KZUbw&xkcb=SoD467M3qzXSRLzNdp0IbzkdCdPP&fccid=d7fe37abf462aefd&cmp=MAJJANE-AGENCY&ti=Stagiaire+D%C3%A9veloppeur+Web&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Data Scientist / Ingénieur IA Confirmé (3 à 6 ans d’expérience) – 100 % Remote",
    "company": "AdmitEase",
    "location": "Rabat",
    "description": "À propos de Talio Talent\nTalio Talent est une startup française qui connecte les talents tech d’Afrique et du Moyen-Orient avec des startups et scale-ups européennes à la recherche de profils confirmés pour des missions à distance.\nNotre mission : révéler le potentiel des talents francophones en leur offrant des opportunités internationales 100 % remote, tout en aidant les entreprises à accélérer leur croissance grâce à des profils techniques expérimentés, coachés et accompagnés.\nDescription du poste\nRejoins une startup française innovante et contribue à des projets concrets autour de la data science, de l’intelligence artificielle et de l’automatisation.\nEn tant que Data Scientist / Ingénieur IA confirmé(e), tu participeras activement à la conception, au développement et au déploiement de solutions data-driven pour des startups françaises et européennes.\nTes missions\nConcevoir et implémenter des modèles de Machine Learning et Deep Learning pour répondre à des problématiques métiers variées (prédiction, classification, NLP, computer vision, etc.)\nConstruire et maintenir des pipelines de données robustes et scalables\nAutomatiser les processus d’analyse et de reporting via des outils et frameworks modernes\nCollaborer avec les équipes produit et tech pour définir les besoins et transformer les insights en solutions concrètes\nAssurer la qualité, la traçabilité et la sécurité des données\nEncadrer ou accompagner des profils juniors lorsque nécessaire\nEffectuer une veille active sur les avancées en IA, LLMs, MLOps et Data Engineering\nProfil recherché\nDiplôme d’ingénieur ou Master (Bac+5) en Data Science, IA, informatique ou ingénierie\n3 à 6 ans d’expérience professionnelle en data science, machine learning ou ingénierie de données\nExcellente maîtrise de Python et de ses principales librairies data (Pandas, NumPy, Scikit-learn, TensorFlow, PyTorch, etc.)\nSolides compétences en bases de données (SQL / NoSQL) et en déploiement de modèles (API, Docker, cloud, etc.)\nBonne compréhension des enjeux business et capacité à vulgariser les résultats\nAutonomie, esprit analytique, rigueur et goût pour le travail collaboratif à distance\nCe que nous offrons\nProjets à fort impact dans des environnements innovants (startups, scale-ups, SaaS, fintech, healthtech, etc.)\nExpérience internationale et possibilité de collaborer avec des équipes multiculturelles\nMission 100 % remote avec flexibilité et autonomie\nAccompagnement personnalisé (coaching technique, suivi de mission, communauté d’experts)\nRémunération compétitive, selon expérience et expertise\nType de contrat\nCDI, CDD ou mission freelance – temps plein / remote\nType d'emploi : CDI, CDD, Profession libérale, Stage, Apprentissage / Alternance\nDurée du contrat : 6 mois\nRémunération : à partir de 5.000,00DH par mois",
    "job_url": "https://ma.indeed.com/rc/clk?jk=b07fff5fe91b3b71&bb=7Si6sPR_aX_z7nezBeSeJ-bJJUIvLUIPNSscX39l-_yRl0_CIChiPJZ2G7N_1J_PkOCKPvZr59l2MICKSDczfSa-n5kfD688F3HMoTe1z66cTFIP8m5NFXx0qxlxn4-lxTaKj3fLH3vKKQ_96pWSp_5lLIGyWMsz&xkcb=SoB267M3qzXSRLzNdp0PbzkdCdPP&fccid=85205e3b730b299a&cmp=AdmitEase&ti=Data+Scientist&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Stage en Audit Financier",
    "company": "PwC",
    "location": "Casablanca",
    "description": "Job Description & Summary\nNOUS SOMMES...\nDans le monde, plus de 360 000 personnes travaillent en réseau dans 151 pays, partageant points de vues, expériences et solutions pour proposer des perspectives innovantes et des conseils adaptés à chaque problématique. Au Maroc, PwC développe cette approche à travers trois entités juridique : ➡ PwC au Maroc : PwC au Maroc (CFC) crée collectivement des résultats durables pour ses clients locaux et régionaux grâce à 400 talents engagés sur des missions de haut niveau qui prennent en compte les enjeux sociétaux et environnementaux, ainsi que ceux liés aux nouvelles technologies: Audit, expertise comptable, conseil juridique et fiscale, conseil en transactions, conseil en gestion des risques, Forensic Services, conseil en stratégie et en management, conseil en technologie (sécurité, Data, IA, machine learning), Change Management, ... Nos équipes sont toutes spécialisées et se fondent dans un collectif pluridisciplinaire afin de mieux appréhender les enjeux globaux de nos clients. ➡ PwC Services à Casa Nearshore : Depuis plus de 10 ans, PwC Services réalise l'audit de certains cycles en collaborant à distance avec les équipes d'audit et les clients de PwC France. Nos équipes bénéficient d'une spécialisation sectorielle : Industrie et Services, Banque, Assurance, Immobilier. ➡ PwC Remote Team (CFC) - L'audit autrement: La Remote Team est une nouvelle équipe en pleine croissance, engagée dans un audit de haute qualité et de creation de valeur pour les clients Français et internationaux de PwC. Elle répond aux besoins et aux enjeux de nos différentes parties prenantes, aidant à debloquer des opportunités pour nos clients et nos collaborateurs et contribuant à rendre plus de choses possibles. Cette équipe se positionne en véritable partenaire de confiance de nos clients d’audit grâce à une parfaite maîtrise des techniques d'audit, des outils digitaux et technologies émergentes.\nNous recrutons des stagiaires PFE en audit financier pour soutenir nos projets. Vos principales missions consisteront à :\nIntervenir sur les différeentes phases et cycles complexes de l’audit en réalisant les travaux d’audit nécessaires pour permettre au commissaire aux comptes de se forger une opinion sur la nature sincère et fidèle des comptes publiés\nAvoir l’opportunité d’évoluer directement auprès de nos clients tout en intervenant sur divers secteurs d’activité et sur une large palette de sujets\nIntervenir sur des missions spéciales à forte valeur ajoutée auprès d’acteurs de renoms et ainsi développez votre expertise technique et sectorielle.\nGagner rapidement en responsabilités et devenez acteur de votre carrière chez PwC",
    "job_url": "https://ma.indeed.com/rc/clk?jk=03222730416b4c69&bb=7Si6sPR_aX_z7nezBeSeJ-w1A6-pUMx3EEJCrqpYbIMiUDttqNja1sdaf_bbsXuMzjJ2M-4TMUVRYo2kNdXibGFQFAc-QfsPfjHQA3KGdquXLFKVVtfkcuQ7jqfxerK24YNvwV5xt0lhshQ2rfe4ckAouA0BaTue&xkcb=SoDC67M3qzXSRLzNdp0ObzkdCdPP&fccid=5e964c4afc56b180&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=03222730416b4c69&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=52d470b73a56b8f8&assa=6715",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Assistant(e) RH – Stage pré-embauche",
    "company": "Software Business",
    "location": "Remote",
    "description": "Tu rêves de débuter ta carrière dans un cadre international, innovant et stimulant ?\nNous sommes une entreprise américaine spécialisée en marketing digital, IT et machine learning, en collaboration avec des acteurs marocains, et nous recrutons !\nCe que nous t’offrons :\nStage pré-embauche avec accompagnement et formation RH\nMéthodes de travail modernes\nMentorat par des professionnels + réelle évolution possible\nPossibilité de télétravail\nTes responsabilités :\nParticiper au recrutement et à l’onboarding\nAssurer le suivi administratif RH\nSoutenir la communication interne et divers projets RH\nProfil recherché :\nBac+2 ou plus en RH/Management\nUne première expérience en RH est un plus\nBon niveau en français et anglais\nMotivation, rigueur et envie d’apprendre\nLieu : Marrakech | Présentiel ou télétravail\nEnvie de grandir dans une équipe qui croit en ton potentiel ?\nPostule dès maintenant !\nType d'emploi : Temps plein\nLieu du poste : Télétravail",
    "job_url": "https://ma.indeed.com/rc/clk?jk=5825f5d3f7b69e2a&bb=7Si6sPR_aX_z7nezBeSeJ8TQOLQSyx7d1PaxIJDEr1cyx46wx0Fp9Etb21X8Jxg3vD6gi0OQfFIWW3UXvfnebwSTrSeuVBEkF7gHEh-kCclqISsiTlXYRxpmPN4tN0Hghcx6vlV_q1zyBbzKfxjEO_N3FXaP-4xq&xkcb=SoBf67M3qzXSRLzNdp0NbzkdCdPP&fccid=8da53c2d6205908a&cmp=Twily&ti=Assistant+Ressources+Humaines&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Stage Dev Python",
    "company": "SAHAM BANK (EX SOCIÉTÉ GÉNÉRALE MAROC)",
    "location": "Casablanca",
    "description": "SAHAM BANK (EX SOCIÉTÉ GÉNÉRALE MAROC)\nCasablanca\nStage\nSur site\nil y a 1 semaine(s)\n\nReference 25000OAE\nResponsibilities\nVous intégrerez l’équipe Trading Process Factory au sein de SG ATS, spécialisée dans l’automatisation des processus métiers et l’innovation technologique, notamment autour du développement Python et de l’intelligence artificielle appliquée aux marchés financiers.\nEncadré(e) par un référent technique, vos principales missions seront :\nDévelopper et maintenir des outils d’automatisation et d’optimisation des processus de trading et de gestion des risques, principalement en Python.\nParticiper à l’implémentation de solutions basées sur l’intelligence artificielle pour améliorer l’analyse des indicateurs de marché, la détection d’anomalies, et l’aide à la décision.\nCollaborer avec les équipes métiers pour comprendre leurs besoins, analyser les problématiques opérationnelles et proposer des améliorations technologiques innovantes.\nContribuer à la documentation technique et fonctionnelle des développements réalisés.\nAssurer la qualité, la robustesse et la performance des outils développés dans un environnement réglementé.\nProfile Required\nVous êtes étudiant(e) en Master, Grande École d’Ingénieurs ou 3e cycle universitaire avec une spécialisation en finance de marché, informatique ou data science.\nVous avez une forte appétence pour le développement logiciel, notamment en Python, ainsi qu’un intérêt marqué pour l’intelligence artificielle et ses applications dans la finance.\nVous êtes motivé(e) par les environnements internationaux et les enjeux liés à l’automatisation, la digitalisation des processus et la gestion des risques financiers.\nCompétences requises\nTechniques:\nMaîtrise avancée de Python, avec une expérience en développement d’outils d’automatisation.\nConnaissances en intelligence artificielle / machine learning appliquées à la finance (un plus).\nFonctionnelles :\nCompréhension des processus de trading et de gestion des risques.\nCapacité à analyser des besoins métiers et à proposer des solutions techniques adaptées.\nSoft Skills:\nAutonomie, rigueur et sens de l’initiative.\nEsprit d’équipe et bon relationnel.\nCapacité à documenter clairement les travaux réalisés.\nN’hésitez pas à postuler pour rejoindre une équipe dynamique où technologie et finance de marché se conjuguent pour relever les défis de demain.\nBusiness insight\nFiliale du Groupe Société Générale, Société Générale Africa Technologies and Services (SG ATS) a été créée en 2014 pour fournir des solutions agiles et innovantes aux salles des marchés de la banque en Europe (principalement Paris et Londres). SG ATS accompagne le développement des activités de marché en répondant aux exigences croissantes des réglementations bancaires internationales. Fort de son succès, SG ATS vise à devenir un centre multi-services à forte valeur ajoutée, intervenant auprès de plusieurs lignes métiers du Groupe (Europe, États-Unis, Asie) sur des activités de marchés, ainsi qu’auprès des directions des risques, financière, conformité et autres directions centrales.\n« Les informations recueillies sur ce site font l’objet d’un traitement destiné à répondre aux besoins de recrutement de la société SG ATS. Ces données sont traitées par les services internes de la société. Conformément à la loi n° 09-08 promulguée par le Dahir 1-09-15 du 18 février 2009, relative à la protection des personnes physiques à l’égard du traitement des données à caractère personnel, vous bénéficiez d’un droit d’accès et de rectification aux informations qui vous concernent, que vous pouvez exercer. Vous pouvez également, pour des motifs légitimes, vous opposer à ce que les données qui vous concernent fassent l’objet d’un traitement. Ces données peuvent faire l’objet d’un transfert à l’étranger. Ces traitements ont été notifiés et autorisés par la CNDP sous les numéros A-RH-354/2016 et T-RH-129/2016.\nDiversity and Inclusion\nWe are an equal opportunities employer and we are proud to make diversity a strength for our company. Societe Generale is committed to recognizing and promoting all talents, regardless of their beliefs, age, disability, ethnic origin, nationality, membership of a political, religious, trade union or minority organisation, or any other characteristic that could be subject to discrimination.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=771116d1a8a09cb9&bb=7Si6sPR_aX_z7nezBeSeJ_fB8Qmh4BOBOnybR90X6qVw1LJR5MzZbNtP7u-8BZ83h7Gi7wuZp9W77yx3WClKHgK6tosYlvmwaKD30zlEALnKn5Jqi35-u9GgReyNvqmnr6BH4HtWqyR8uFhRKuBf-E90VoF_q_z3&xkcb=SoDr67M3qzXSRLzNdp0MbzkdCdPP&fccid=eb1a50b324aa6243&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=771116d1a8a09cb9&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=c225b7bab5eef158&assa=5227",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Opportunité de Stage – Développeur Full Stack & IA – Rémunéré",
    "company": "SMILYCALL",
    "location": "Marrakech",
    "description": "SMILYCALL\nMarrakech\nStage\nHybride\nil y a 1 moi(s)\n\nSmilycall le leader du télésecrétariat qui révolutionne l’accompagnement administratif grâce à la digitalisation et l’intelligence artificielle.\nNous recherchons un talent d’exception.\nUn(e) Développeur(se) Full Stack passionné(e) par l’IA et l’automatisation, prêt(e) à relever un vrai défi : construire des solutions digitales innovantes qui transforment radicalement la manière dont nous gérons les services de télésecrétariat.\nCe stage n’est pas un simple projet de fin d’études — c’est une immersion dans une entreprise visionnaire où tu développeras des outils concrets, intégreras l’IA pour automatiser des processus complexes, et participeras à la transformation digitale d’un secteur entier.\nProfil recherché\nIngénieur ou Master en Informatique / Génie Logiciel / Data Science (Bac+5)\nMaîtrise du développement Full Stack (Front-end + Back-end)\nNotions solides en Intelligence Artificielle et Machine Learning\nPassionné(e) par l’automatisation, les API et l’innovation technologique\nCapable de transformer un besoin métier en solution technique élégante\nEsprit analytique, créatif et orienté résolution de problèmes\nAutonome, rigoureux(se) et avide d’apprendre\nTes futures missions\nDéveloppement & Digitalisation\nConcevoir et développer des applications web pour digitaliser nos processus de télésecrétariat\nCréer des interfaces utilisateurs intuitives et performantes (dashboards, CRM, outils de gestion)\nDévelopper des API robustes pour connecter nos différents systèmes\nOptimiser et maintenir notre infrastructure technique\nIA & Automatisation\nIntégrer des solutions d’IA pour automatiser des tâches répétitives (traitement d’emails, classification de documents, chatbots)\nDévelopper des systèmes de reconnaissance vocale et de transcription automatique\nImplémenter des outils d’analyse de données et de prédiction\nCréer des workflows intelligents pour améliorer l’efficacité opérationnelle\nInnovation Continue\nFaire de la veille technologique sur les nouvelles solutions IA/automatisation\nProposer et prototyper des innovations qui donnent un avantage concurrentiel\nParticiper à l’architecture et à la stratégie technique de l’entreprise\nStack technique recherchée\nFront-end :\nJavaScript / TypeScript (React, Svelte)\nHTML5, CSS3, Tailwind CSS\nResponsive Design & UX/UI\nBack-end :\nNode.js, Python\nAPIs REST\nBases de données (MySQL, PostgreSQL, MongoDB)\nIA & Automatisation :\nPython (TensorFlow, PyTorch, scikit-learn)\nAPIs IA (OpenAI, Google Cloud AI)\nAutomatisation ( n8n)\nNLP (Natural Language Processing)\nConditions\nLieu : Marrakech + télétravail partiel\nRémunération : Attractive + primes sur objectifs\nDurée : 2 a 6 mois (stage pré-embauche)\nCDI garanti à l’issue du stage pour les profils performants\nPourquoi nous rejoindre ?\nParce que tu ne coderas pas “juste pour coder”, mais pour créer des solutions qui ont un impact réel et immédiat.\nIci, tu auras :\nL’autonomie de proposer et implémenter tes propres idées\nL’impact direct sur la croissance de l’entreprise\nL’apprentissage continu avec des technologies de pointe (IA, automatisation)\nLa reconnaissance : ton talent sera valorisé et récompensé par un CDI\nTu ne seras pas un développeur parmi d’autres — tu seras l’architecte de notre transformation digitale.\nCandidature :\nEnvoie ton CV + Portfolio GitHub (projets, repos, contributions) à :\nObjet : “Développeur Full Stack & IA – [Ton Prénom]”\nBonus : Un projet personnel en IA/automatisation ou un lien vers une démo de tes réalisations.\nSeuls les profils les plus prometteurs seront contactés pour un entretien technique.\nNous recherchons l’excellence, pas la moyenne. Si tu es prêt(e) à construire l’avenir du télésecrétariat avec la tech et l’IA, cette opportunité est pour toi.\nType d’emploi : Temps plein, Stage\nDurée du contrat : 6 mois",
    "job_url": "https://ma.indeed.com/rc/clk?jk=8433f35dc3c35c49&bb=7Si6sPR_aX_z7nezBeSeJzXP0L2PxqPi9rPifm7W6l0abik-dHjvy1IR8ONBek242GiL2y3PgYg3kY631hxjGvSVXzlecqrH2GvzqyVG7kmhNoCkC9n2DqR6tpHqx65vKyc26ZcS9iF65PRSks0LPIjTussO2Rpp&xkcb=SoAC67M3qzXSRLzNdp0DbzkdCdPP&fccid=e7fba0f396b07df8&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=8433f35dc3c35c49&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=00c1ea662156e072&assa=9121",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Stagiaire Datalab",
    "company": "COFACE",
    "location": "Casablanca",
    "description": "COFACE\nCasablanca\nStage\nHybride\nil y a 1 moi(s)\n\nDescription de l’entreprise\nChez Coface, nous faisons avancer le commerce chaque jour.\nNos 5 200 experts, représentant plus de 80 nationalités dans 58 pays, sont unis par une mission commune : aider les entreprises à naviguer dans l’incertitude en leur donnant les moyens de prendre les bonnes décisions et de commercer plus intelligemment dans un monde complexe.\nAvec près de 80 ans d’expérience internationale, nous proposons aux entreprises une gamme complète de solutions : assurance-crédit, informations d’entreprise, recouvrement de créances, assurance risque unique, cautions, affacturage — le tout porté par un patrimoine de données unique, une technologie de pointe, de l’innovation et une compréhension approfondie de l’économie mondiale.\nRejoindre Coface, c’est intégrer une organisation internationale soudée, où vos idées comptent. Nous cultivons une culture d’apprentissage, de collaboration et d’inclusion, où vous avez des responsabilités et pouvez constater l’impact de vos actions.\nFaçonnez l’avenir du commerce avec nous.\nRejoignez les Happeners !\nDescription du poste\nNotre DataLab est à la recherche de stagiaires passionnés par la donnée, curieux et motivés pour apprendre et contribuer à des projets innovants autour de l’intelligence artificielle, du machine learning et de l’analyse de données.\nMissions :\nVous intégrez l’équipe de Data Lab de Coface et travaillez le plus souvent en binôme ou dans des équipes réduites sur des projets innovants\nVous concevez et développez complètement des solutions pouvant mettre en œuvre des technologies de Machine Learning, jusqu’au déploiement sur nos infrastructures de containers ou dans le cloud, et au monitoring en production\nVous contribuez à la veille technologique\nQualifications\nFormation d’Ingénieur ou équivalent en Data Science\nMaîtrise des modèles d’apprentissage supervisé et non-supervisé, clustering, NLP…\nMaîtrise de Python, son écosystème et des bonnes pratiques\nAutonomie, curiosité, rigueur\nAnglais : projets dans des contextes internationaux\nCompétences appréciées :\nUtilisation de Linux et Git\nExpérience en développement d’application Python avec des standards de qualité élevés\nMise en œuvre de chaîne CI/CD\nExpérience de déploiement Docker/Kubernetes et d’application dans le cloud\nPratique de SQL et expérience en bases NoSQL (document, graph)",
    "job_url": "https://ma.indeed.com/rc/clk?jk=93d147db4744809a&bb=7Si6sPR_aX_z7nezBeSeJ1Dy6T5NRzUc5TUjq2fMpt7VLxZcQsXLWG4QQ9O0vi7m8rS6IFgHZk29OAnZdga6gptFpL4_FeUkI_vr9od_OF7ucORNAzudrui4C9nWZAe9KOxTm9-1cfWuJ-ZdlC3boFfGsxv1kjM4&xkcb=SoC267M3qzXSRLzNdp0CbzkdCdPP&fccid=75f93e975afa917b&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=93d147db4744809a&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=2b7897ae910bd009&assa=2890",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "PFE DET 2026",
    "company": "Expleo",
    "location": "Tanger",
    "description": "Description du poste:\nGroupe EXPLEO, plus qu’une histoire, une aventure humaine…\nLe Groupe EXPLEO s’appuie sur 19000 collaborateurs hautement qualifiés qui fournissent des solutions à forte valeur ajoutée dans 30 pays. Expleo vous aide à réaliser vos ambitions et à assurer, ensemble, votre avenir. Nous vous offrons un mélange unique de réflexion audacieuse et d’exécution fiable, pour accélérer l’innovation à travers chaque étape de votre chaîne de valeur.\nAu-delà de rejoindre une entreprise, c’est donc une aventure humaine que nous vous proposons de VIVRE !!#LI-SH1\nMissions:\nNous recherchons plusieurs stagiaires PFE pour rejoindre notre département Digital, au sein d’une équipe engagée dans le développement de solutions innovantes orientées Data, Intelligence Artificielle et Transformation digitale.\nLes stagiaires seront intégrés au cœur de nos projets numériques et contribueront à la conception, au développement et à l’amélioration de solutions digitales à forte valeur ajoutée.\n\nUn encadrant technique vous accompagnera tout au long du stage pour assurer une montée en compétence progressive et un suivi régulier\nQualifications:\nÉtudiant(e)s en dernière année en Génie Informatique, Data Engineering, Data Science, IA / Machine Learning, Systèmes d’Information, ou équivalent\nCompétences attendues (selon profil) :\nProgrammation : Python / JavaScript / SQL / autres\nData : Power BI, Pandas, ETL, Data Visualization\nIA : Machine Learning, Deep Learning, modèles supervisés / non supervisés\nConnaissance de frameworks ou outils cloud (atout)\nCuriosité, autonomie et esprit d’initiative\nBon niveau de communication en Français/ Anglais",
    "job_url": "https://ma.indeed.com/rc/clk?jk=22c74ee34feb5d65&bb=7Si6sPR_aX_z7nezBeSeJ3x-uM6F1V29k7yx1hl6I7hKeEMW06Vg0H_oKaQg_uu5gwSYNrSJufas_d914NbH9GLQNcudb69y_IiA5cF7hmhQ0AeyEc_rw2TwGq3HhHIjabp02tR-Q8-YI9_AJFHi0JIHPa_aFT1R&xkcb=SoAr67M3qzXSRLzNdp0BbzkdCdPP&fccid=8f5cb52d4dd4f2ad&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=22c74ee34feb5d65&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=885a1f51447697ba&assa=7653",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Stage en Ingénieur Simulation sur Matlab/ Simulink/ Ingenieur procédés/ AI Big data",
    "company": "DHT TECHNOLOGY",
    "location": "Agadir",
    "description": "DHT TECHNOLOGY\nAgadir\nStage\nHybride\nil y a 1 semaine(s)\n\nDTH technology SARL cherche étudiants motives qui maitrisent:\nMatlab Simulink, modelisation procedes\nBig Data / Machine Mearning / AI , Gen AI, ChatGPT. Agentic AI\nDeep Learning, Optimization, isualization des donness en temps reel\nAnglais impératif,\nStage avec compensation selon profil et performance.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=d36b70959313a4a7&bb=7Si6sPR_aX_z7nezBeSeJzCfw0XLBoUlK74_gcpTOWaDR_mQGCk4_Ff_7F-h7znq_UuqlxTcqwNBGhUz-K3m3nhQA045Vt02KUgi-tNhbsZc9NGnmRUA-Ctt2ZCl6UEpRYu-9fXDfmRlQajbMQktH8rJyqtv4xhi&xkcb=SoCf67M3qzXSRLzNdp0AbzkdCdPP&fccid=b30d99f34edcabdc&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=d36b70959313a4a7&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=67d228e97a734a0b&assa=1690",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "",
    "company": "",
    "location": "",
    "description": "",
    "job_url": "https://ma.indeed.com/viewjob?jk=456789abcdef0123",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Assistante RH – Poste Pré-Embauche Option – Télétravail",
    "company": "CUSTOMER OBSESSION",
    "location": "Marrakech",
    "description": "CUSTOMER OBSESSION\nMarrakech\nStage\nHybride\nil y a 2 moi(s)\n\nDescription du poste :\nNous sommes une entreprise multinationale basée aux États-Unis, spécialisée dans le marketing digital, l’IT et le machine learning. Nous collaborons également avec des entreprises marocaines pour fournir des solutions marketing et d’autres services.\nNous recherchons une assistante RH motivée pour un poste pré-embauche à Marrakech avec possibilité de télétravail. Vous bénéficierez d’une formation pratique en Management RH avec le concept startup américain.\nPourquoi postuler ?\nOpportunité unique de travailler dans une entreprise internationale et dynamique\nDéveloppement de compétences en RH avec des méthodes innovantes et startup\nEncadrement par des professionnels expérimentés et mentorat personnalisé\nPossibilité réelle de carrière à long terme et évolution rapide\nOption de travail à distance pour plus de flexibilité\nResponsabilités :\nAssister dans les tâches quotidiennes du département RH\nParticiper au recrutement et à l’onboarding des nouveaux employés\nGérer les communications internes et le suivi administratif\nContribuer à l’implémentation de projets et processus RH\nProfil recherché :\nBac+2 en Ressources Humaines, Management, Administration ou domaine similaire\nCompétences en communication en français et anglais\nMotivée pour apprendre et évoluer dans un environnement international\nCapacité à travailler en équipe et à gérer plusieurs tâches\nLieu :\nMarrakech, Maroc (ou télétravail)\nType d’emploi :\nTemps plein, Stage",
    "job_url": "https://ma.indeed.com/rc/clk?jk=84612f1b7c5bb883&bb=7Si6sPR_aX_z7nezBeSeJ6khm6JKkMF3rlkINmFhKNHQWRyHllhhZHDbvogpEN8Vh6emyYbyM4YfEi2gmQ9p4HPUbciUO0Hhfhq5p0PtItVHQcqDLiW50fKB5Yt8N3mN4CizX_jYqUMXE7ISMqZkI_netnuqCCij&xkcb=SoAR67M3qzXSRLzNdp0HbzkdCdPP&fccid=34ae47c179dbb5ff&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=84612f1b7c5bb883&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=7cf93317ee2475f6&assa=9143",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Automotive Engineering - Development Engineering- STAGIAIRES F/H",
    "company": "Renault Group",
    "location": "Tanger",
    "description": "Société\nRENAULT TECHNOLOGIE MAROC\nDescriptif du poste\nRenault Technologie Maroc propose des stages de fin d’études pour des étudiants motivés, souhaitant participer à des projets innovants et techniques dans les domaines de l’ingénierie industrielle, de l’automatisation, et de l’intelligence artificielle appliquée à l’industrie automobile.\nLes missions proposées s’articulent autour du développement et de l’optimisation de systèmes techniques : contrôle intelligent d’accès, automatisation de systèmes de contrôle thermique, et détection de défauts par vision IA.\nCes stages permettront aux étudiants de contribuer à des solutions innovantes visant à améliorer la performance opérationnelle, la qualité et la fiabilité des process industriels, tout en intégrant des technologies avancées telles que l’IA et les systèmes embarqués.\nProfils recherchés :\nÉtudiants en dernière année Bac+4/Bac+5 en Génie Mécanique , Electrique et Électronique Système embarquée et Intelligence Artificiel\nConnaissances souhaitées :\nInformatique industrielle et programmation : Maîtrise des langages et environnements liés aux systèmes embarqués (ex. Raspberry microcontrôleurs), connaissance des automates programmables et langages associés .\nAutomatisation et contrôle : Compréhension des systèmes de contrôle de température, motorisation, et processus industriels.\nIntelligence artificielle et vision par ordinateur : Notions de machine Learning, traitement d’images et détection de défauts par caméra.\nOutils bureautiques : Maitrise d’Excel, et capacité à développer des macros pour automatiser des tâches répétitives.\nGestion de projets techniques : Capacité à analyser une problématique, proposer une solution technique adaptée et assurer la mise en œuvre.\nMétier\nRecherche & Développement\nDurée du contrat\n6 months\nRenault Group s’engage à créer un environnement de travail inclusif et les conditions permettant à chacun de nous d’apporter sa passion, donner le meilleur de lui-même et s’épanouir, tout en étant lui-même.\n\nNous trouvons notre force dans notre diversité et nous nous engageons à garantir l'égalité des chances en matière d'emploi, indépendamment de la couleur, de l'ascendance, de la religion, du sexe, de l'origine nationale, de l'orientation sexuelle, de l'âge, de la citoyenneté, de l'état civil, du handicap, de l’identité de genre, etc. Si vous avez un handicap ou un besoin particulier nécessitant l’aménagement du poste de travail ou de l’horaire de travail, merci de nous le faire savoir en remplissant ce formulaire.\nAfin de pouvoir suivre en temps réel l'évolution de vos candidatures et pouvoir rester en contact avec nous, nous vous invitons à créer un compte candidat. Cela ne vous prendra pas plus d’une minute et vous permettra également de faciliter vos prochaines candidatures.\n\nEn soumettant votre CV ou votre candidature, vous autorisez Renault Group à utiliser et stocker des informations vous concernant à des fins de suivi de votre candidature ou de futurs emplois. Ces informations ne seront utilisées que par les sociétés de Renault Group tel que mentionné dans la\nPolitique Groupe de protection des données personnelles\n.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=c30ac52b974c5960&bb=7Si6sPR_aX_z7nezBeSeJ75-ievsIc5tHp_Z7GztRC8v9ziJohDzvgCuLqIFfZSSG6Na_uhHKekYxVAYo9Y06L_rq9qN8xFVXakcemTDcxVN8irW6gCahx1TpnGOtupzEV3_dXsIkEecNhVwyK3qwq8izpST8NOJ&xkcb=SoCl67M3qzXSRLzNdp0GbzkdCdPP&fccid=d87a03e3623e180d&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=c30ac52b974c5960&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=41a691891191c0d8&assa=2024",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "stage machine learning",
    "title": "Consulting Manager – Strategy & Transformation",
    "company": "Artefact",
    "location": "Casablanca",
    "description": "Qui sommes-nous ?\nArtefact est une société internationale de conseil en services data et IA, dont le siège est à Paris, qui depuis 10 ans est spécialisée dans la conception et le déploiement de technologies d'intelligence artificielle et de solutions data-driven, dont la mission est d'accélérer l'adoption de l'IA pour un impact positif sur les individus et les organisations.\nPionnière dans son domaine, à partir des données et de technologies avancées d'intelligence artificielle, les équipes de consultants métiers et d'ingénieurs travaillent ensemble pour développer des solutions qui créent de l'impact business et améliorent la productivité sur l'ensemble de la chaîne de valeur des entreprises, et ce dans le respect d'un usage éthique et responsable de la data.\nAlliant le meilleur de l'expertise technologique et de l'excellence opérationnelle, Artefact accompagne plus de 1000 sociétés dans le monde pour accélérer leur transformation business, dont plus de 300 entreprises internationales telles qu'Orange, Samsung, L'Oréal ou encore Sanofi. Ses 1700 experts répartis dans 27 bureaux à travers le monde, interviennent dans tous les secteurs clés de l'économie : industrie, retail, luxe, grande consommation, santé, finance, etc…\nEn tant que Stagiaire Data Consultant, tu seras pleinement intégré(e) à une équipe de consultants. Ton rôle sera d'assister nos clients dans l'élaboration et la mise en œuvre de leur stratégie data, de la phase d'idéation jusqu'à l'implémentation. Tes missions pourront inclure :\nCadrage / gestion des projets : interview clients et partenaires, mise en place de workshops, préparation des uses cases…\nConstruction de roadmaps, d'analyses data-driven avec l'équipe projet et conception d'infrastructures en collaboration avec nos experts\nOrchestration du bon déroulement du projet, en appliquant le cas échéant les méthodes agiles (sprints planning et reviews, backlog refinement, démos…)\nVeille technologique et sectorielle : rester à l'affût des dernières tendances en matière de data et d'intelligence artificielle pour proposer des solutions innovantes.\nCommunication : Préparer des présentations et des supports de communication pour les comités de direction et les équipes clientes.\nProcessus de recrutement\nÉtape 1 : Un entretien de fit avec un senior Data Consultant.\nÉtape 2 : Un entretien de type business case avec un premier tour avec un senior ou un manager Data Consultant. Le but de cet entretien est de tester vos méthodes et capacités déductives, votre capacité à résoudre un problème et de confirmer votre intérêt pour Artefact (1 heure)\nProfil recherché\nFormation : tu es étudiant(e) en dernière année de cycle ingénieur ou au sein d'une grand école de commerce avec une spécialisation en Data, Conseil, ou Management de l'Innovation et tu recherches ton stage de fin d'études à partir de Janvier 2026\nCompétences :\nFort intérêt pour la Data Science et les technologies de la donnée. Tu n'es pas nécessairement un(e) expert(e) technique, mais tu comprends les concepts clés du machine learning, de la Business Intelligence, et du Big Data.\nExcellentes compétences analytiques et de synthèse.\nMaîtrise avancée de la suite Microsoft Office (en particulier PowerPoint et Excel).\nUne connaissance de SQL ou d'un outil de visualisation de données (Power BI, Tableau) est un plus.\nQualités personnelles :\nSens de la communication et du relationnel : Tu es capable de t'exprimer clairement et de t'adapter à différents interlocuteurs.\nProactivité et autonomie : Tu es force de proposition et prends des initiatives.\nRigueur et organisation : Tu es capable de gérer plusieurs tâches et de respecter les délais.\nFrançais courant pour travailler en équipe et anglais professionnel obligatoire pour nos clients internationaux\nCe que nous offrons\nUn stage de 6 mois basé à Casablanca.\nUn environnement de travail stimulant au sein d'une équipe dynamique et experte.\nL'opportunité de travailler sur des projets concrets avec des entreprises de premier plan.\nLa possibilité d'être embauché(e) en CDI à la fin du stage.\nSi tu es passionné(e) par la data et que tu souhaites développer une double compétence en conseil et en technologie, envoie-nous ta candidature !",
    "job_url": "https://ma.indeed.com/rc/clk?jk=4f36dd228eae80af&bb=7Si6sPR_aX_z7nezBeSeJ0uEVvvuO3kuZ6WXCIIPhu9nGUyL5T5Dib4JVNK-yTmEZragXF4Z_zyIy2pxJVipCGUoE8jR0g8hk3JDpzAqDF2OLjBSdL_tD7hyncORpYdzFTfGQ9bgeJ_opLQ3WVHSkHYw5wF8YsEX&xkcb=SoA467M3qzXSRLzNdp0FbzkdCdPP&fccid=c1f750eaef1d79c4&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=4f36dd228eae80af&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=403ce02cc8fa9613&assa=5939",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "AI Engineer",
    "company": "ELAVI AGENCY",
    "location": "Casablanca",
    "description": "casablanca, Maroc\nQUI SOMMES-NOUS\nElavi est une entreprise de services professionnels qui accompagne les entreprises et organisations dans les domaines de stratégie, informatique, marketing et opérations depuis plus de 10 ans basée à Bruxelles et Casablanca.\nLE POSTE\nDescription du poste :\nEn tant qu’AI Engineer, vous serez en charge de concevoir, développer et intégrer des solutions d’intelligence artificielle sur mesure, répondant aux besoins métiers de notre entreprise et contribuant à l’amélioration de nos services internes.\nResponsabilités :\n\nIdentifier et comprendre les besoins métiers pouvant être améliorés ou automatisés par l’intelligence artificielle\nConcevoir, développer et tester des solutions IA adaptées à des cas d’usage concrets\nIntégrer des modèles IA existants via des API (OpenAI, Mistral, Claude…) ou des frameworks comme Hugging Face, LangChain, etc.\nCollaborer étroitement avec les équipes métiers pour traduire leurs besoins en solutions techniques efficaces\nAssurer la mise en production et le suivi des outils IA développés (robustesse, performance, mise à jour)\nDocumenter les développements réalisés et transférer les compétences aux équipes internes\nFaire de la veille technologique pour proposer des améliorations continues et rester à jour sur les innovations IA utiles à l’entreprise\nProfil recherché :\nDiplômé(e) en informatique, data science, intelligence artificielle ou équivalent\nExpérience concrète dans le développement de projets IA appliqués en entreprise\nMaîtrise des outils IA et frameworks tels que Python, TensorFlow, PyTorch, LangChain, Hugging Face, OpenAI API, etc.\nBonne capacité à travailler avec des équipes métiers non techniques\nCurieux.se, autonome, rigoureux.se et orienté(e) solution\nLa connaissance d’Odoo ou d’outils no-code/low-code est un plus\nCE QUE NOUS OFFRONS\nL’entreprise :\nTravail au sein d’une entreprise organisée en 4 pôles de services avec 9 départements, plus de 30 spécialités et plus de 50 collaborateurs, en forte croissance.\nBureaux centraux et agréables à Casablanca, Bruxelles, et d’autres ouvertures prévues.\nEnvironnement de travail qui encourage la prise d’initiative et la créativité.\nAvantages financiers :\nPrime équivalente au 13e mois mensualisé sous conditions (après 6 mois d’ancienneté).\nAssurance maladie de base privée (après 1 semaine d’ancienneté).\nÉquilibre entre vie professionnelle et personnelle :\nHoraire flexible (démarrage entre 8:00 et 9:00).\nWeekend libre.\nPériode de congé annuel flexible.\nHeures supplémentaires peu fréquentes et récupérables (après 6 mois d’ancienneté).\nÉgalité hommes-femmes :\nGarantie de l’égalité entre hommes et femmes en matière de recrutement, rémunération, traitement et protection, prise en compte des événements personnels, et de promotion (60% de managers femmes et 37% de collaborateurs femmes).\nInternational :\nTravail dans un contexte international multiculturel.\nPrise en charge de déplacements internationaux ponctuels selon les besoins de l’entreprise.\nPrise en charge de la migration ou relocalisation internationale de l’employé possible selon les besoins de l’entreprise.\nFormation :\nOpportunités d’apprentissage entre collaborateurs intra et inter spécialités.\nPrise en charge de formations externes ponctuelles.\nAutres avantages :\nRéception du salaire entre le 27 et le dernier jour du mois.\nPlusieurs activités de renforcement des équipes (teambuildings) mensuelles et annuelles.\nExercice d’une activité professionnelle parallèle en dehors du temps de travail possible sur demande.\nTélétravail national possible sur demande.\nÉvolution possible et encouragée.\nD’autres avantages en projet.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=ab1678f833daab36&bb=6eEMPDhkbhBLuYk_eNZhmVrrK8eBXnhjSGhEtDAYUUM62gXARyt5g4OyQhVO9HLL4Rm0Kxe_e-ICfue65Q70u0C0gMQN-P1-w_fHd0fkuCc1JouKLXNE35umbKW3YeprYU0xHlMYREl-3ujzXsWJtw%3D%3D&xkcb=SoDu67M3qzXpeGzNpp0LbzkdCdPP&fccid=37fafd7207d181be&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=ab1678f833daab36&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=1985532f9ac05f8f&assa=2766",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "AI Machine Learning Optimization Engineer H/F",
    "company": "Stellantis",
    "location": "Casablanca",
    "description": "Job ID: 2022-12111\nCareer Area: Software Electric & Electronics\nJob Category: Salaried\nLocation: Casablanca, Settat\n, MA\nDate Posted: March 2, 2023\n\nStellantis’ AI team is expanding and offers exciting job opportunities for exceptional candidates to contribute to AI services and AI for autonomous driving. As a member of the Machine Learning Infrastructure team, you will be contributing to the development activities for new features and services. You will be taking part in optimizing our deep learning models before implementing on the ECU targets, using the available resources as cleverly as possible. This position offers a high level of interaction with other AI development teams, and support entities within the group. The ideal candidate will have a solid experience of running Machine Learning trainings and validation, as well as setting up the tools implied in the associated workflows\nEOE/Disability/Veteran\nAt Stellantis, we assess candidates based on qualifications, merit and business needs. We welcome applications from people of all gender identities, age, ethnicity, nationality, religion, sexual orientation and disability. Diverse teams will allow us to better meet the evolving needs of our customers and care for our future.\nOur benefits reflects the STELLANTIS commitment to helping you reach your personal and professional goals. In addition to an environment that promotes career development, we offer benefits for a healthy lifestyle and a rewarding future, designed to take care of you and your family, in various stages of life.\nAs a global company, our employee packages will vary by country, customary norms and the legal entity into which you are hired.\nWe care about your privacy. For more information on how your personal data is processed, please read the specific Privacy Statement provided by the respective entities whose job offer you have selected.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=21b0387c75284b64&bb=6eEMPDhkbhBLuYk_eNZhmS3VRxtfmrqHNH70SCYRXg6OqaymNw3lXkoFT1eVumtzSiuMLnyS9PH-aupAJ6JhsTiafKIoZauBSaf-2sOLBne9W8ZsGEC6T15FhmtrY1lgjgAsDmHNdWpUWgL1XUYw8g%3D%3D&xkcb=SoBa67M3qzXpeGzNpp0KbzkdCdPP&fccid=f6172562f9aeed68&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=21b0387c75284b64&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=449fc7d32ab36e8b&assa=7209",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "",
    "company": "",
    "location": "",
    "description": "",
    "job_url": "https://ma.indeed.com/viewjob?jk=cdef0123456789ab",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "AI Engineer / Data Scientist Expérimenté F/H",
    "company": "Deloitte",
    "location": "Maroc",
    "description": "« Tous nos postes sont ouverts au télétravail »\nRejoindre Deloitte, c'est dire oui à une expérience qui a du sens, celle où les rencontres et les missions vous poussent à grandir chaque jour. C’est évoluer dans un environnement de travail basé sur la confiance, la transmission et l’intelligence collective pour construire l’avenir de nos clients. Un avenir que nous voulons plus responsable, plus durable et respectueux de l’environnement en prenant des initiatives concrètes à notre échelle.\nNous rejoindre, c’est aussi dire oui à une entreprise attachée au bien-être, et à l’inclusion sans distinction de nos collaborateurs.\nEt vous, prêts à dire # ISayYes à votre futur chez Deloitte ?\nDeloitte Extended Services , basé à Casablanca est une filiale à 100% de Deloitte France et constitue un centre de responsabilité à part entière.\nEn support de différentes member firmes, Deloitte Extended Services mobilise ses talents au service de clients de toutes tailles et de tous secteurs, couvrant une large palette d'offres : Audit et Risk Advisory, Consulting, juridique & fiscal et fonctions supports. Notre Delivery Center se positionne également comme un centre d'expertises en matière de nouvelles technologies au Maroc ainsi qu'au sein du Groupe Deloitte. Nos consultants et nos experts travaillent sur des projets de grande envergure, avec une diversité de missions et de secteurs à l’échelle internationale .\nQuel sera votre rôle dans la #TeamDeloitte ?\nVous intégrez notre équipe Engineering, AI & Data en tant que Consultant expérimenté Data Scientist/AI Engineering pour intervenir sur des missions variées visant à accompagner nos clients dans les projets de transformation data et IA. A ce titre, vous occuperez les responsabilités suivantes :\nCompréhension approfondie des statistiques.\nCapacité à explorer, nettoyer et transformer les données.\nConstruction et évaluation de modèles prédictifs.\nSolides bases en algorithmes pour l’optimisation des modèles.\nExpérience avec des frameworks de deep learning comme TensorFlow, PyTorch, ou Keras.\nExpérience avec les techniques de NLP & Computer Vision\nFamiliarité avec les services Cloud (AWS, GCP, Azure).\nExpérience avec les containers et systèmes de déploiement comme Docker et Kubernetes.\nCapacité à expliquer des concepts complexes à des parties prenantes non techniques.\nCompréhension des implications éthiques du développement AI.\nProtocole de sécurité des données et des algorithmes.\nUtilisation de bibliothèques de visualisation comme Matplotlib, Seaborn, ou Plotly.\nPrésentation des résultats de l’analyse de manière claire et compréhensible.\nEt si c’était vous ?\nVous êtes titulaire d’un Bac+5 d'une école d'ingénieurs ou de commerce avec une spécialisation en DATA (BI, Big data, Data Science…) et bénéficiez d’une expérience de 2 ans minimum dans le développement Big Data,\nConnaissance de l'architecture des modèles, de leur optimisation et de leur mise en production.\nConnaissance des techniques de machine learning telles que régressions, arbres de décision, réseaux de neurones, etc.\nExpérience avec Python pour l'analyse de données.\nUtilisation d'outils comme Pandas, NumPy, et autres bibliothèques de manipulation de données.\nMaîtrise de langages comme Python, R, Java, Scala ou C++.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=5a6675c56b0f6a54&bb=6eEMPDhkbhBLuYk_eNZhmWGYor4unp-TYcRBan_PhfohM6_1INICuEyzTo9KC8dTD_xvj-oaF2qaV3bqKsnS4mjIqkYt89OzHKp2z0RhSOPTgN2xb_8AgRHzHCu_v1U5CUqp3KSyCxrRJSyzFJoDRg%3D%3D&xkcb=SoBY67M3qzXpeBTNpp0LbzkdCdPP&fccid=9e215d88a6b33622&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=5a6675c56b0f6a54&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=1045e3c8cf3f462e&assa=4024",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "Data Engineer Intern",
    "company": "Deliverect",
    "location": "Casablanca",
    "description": "At Deliverect, our API-first platform is revolutionizing commerce by providing a connected suite of on and off-premise solutions. We empower both the food and retail industries to expand their revenue and simplify their operations, creating seamless experiences for businesses to sell anywhere and deliver everywhere. Join us in this exciting journey, where your contributions will directly impact how businesses connect with their customers in a rapidly evolving global market.\n\nDepartment Focus:\nThe Cloud Platform department at Deliverect is the engine that drives our customers' success by providing a reliable, scalable, and secure platform for exceptional customer experiences. Our team of passionate engineers and architects constantly innovates and refines our solutions, equipping businesses with the cutting-edge technology they need to thrive in today's competitive landscape and deliver unparalleled ordering experiences.\n\nYour Impact:\nThis role offers a unique opportunity to gain real-world experience working with data at scale in a fast-growing SaaS unicorn. As a Data Engineer Intern, you will directly contribute to building reliable and clean data infrastructure, enabling our analysts and data scientists to derive key business insights, which in turn improves our products and operations globally. You will be supported by a dedicated mentor, ensuring you learn modern cloud data practices while making a tangible impact on Deliverect's platform and customer success.\n\nThis is a full-time, hybrid role with a flexible work schedule, offering 3 days in our Ghent, Belgium office and 2 days from the comfort of your home.\nWhat you will do:\nBuild and maintain robust data pipelines using modern tools like Airflow, dbt, and BigQuery within the Google Cloud Platform (GCP), under the guidance of an experienced mentor.\nClean and organize raw data, transforming it into clear, reliable, and useful datasets to support advanced analysis and data science initiatives.\nCollaborate actively with the data team to solve real data challenges, continuously improve our data systems, and learn new GCP tools and best practices.\nSupport the team by ensuring data availability and quality, directly impacting the accuracy of business reporting and the development of new data-driven product features.\n\nWhat you will Bring:\nCurrently pursuing a degree in Computer Science, Data Science, Economics, or another quantitative field, or equivalent work experience.\nFamiliarity with SQL and basic programming skills (Python preferred).\nA strong interest in learning and working with cloud technologies and data engineering concepts (no prior GCP expertise required—we'll teach you!).\nExcellent problem-solving skills and a strong willingness to learn new concepts and technologies in a supportive team environment.\nA collaborative spirit and effective communication skills for working within a close-knit, international team.\nNice to have (but not required): Any previous experience with cloud platforms, data tools, Git, or data pipeline concepts\nJoin Our Innovative Journey:\n\nAt Deliverect, we're not just building a platform; we're redefining how restaurants and retailers connect with their customers globally. We're looking for agile, ambitious, and resourceful team members who are excited to tackle complex challenges, take calculated risks and contribute to innovative solutions that shape the future of commerce.\n\nWhat You'll Gain by Joining Us:\n\nInvest in Your Growth- We provide a dedicated learning budget to help you expand your skills and knowledge in this dynamic environment.\nSolve Meaningful Challenges- Contribute to tackling some of the most significant challenges in the global tech industry, directly impacting the way businesses operate worldwide.\nDrive Innovation- Immerse yourself in a culture where innovation isn't just a buzzword – our weekly releases and new features ensure you're always working on cutting-edge solutions.\nCollaborate with a Global Team- Be part of a diverse, international team that values transparency, visibility, and a multitude of perspectives.\nBe Part of a Unicorn- Join a rapidly scaling SaaS unicorn at the forefront of the order management industry, where your contributions have significant impact.\nEnjoy Regionally Tailored Rewards- Our compensation and benefits packages are thoughtfully designed to reflect the unique needs of each market, ensuring you’re supported with what matters most—right where you are.\n\nOur Commitment to Inclusion:\n\nWe are dedicated to building a diverse and inclusive workplace where everyone feels valued and has equal opportunities to succeed. We strongly encourage applications from underrepresented groups.\n\nImportant Information:\n\n1. Fluency in English is required, with strong written and verbal communication skills being essential.\n2. Applicants must possess the legal right to work in the country where the role is based, as we are currently unable to provide financial assistance for relocation or travel.\n3. Please note that certain roles may require a background check as a condition of employment, and you will be informed of this during the initial screening process.\n\nIf you require any accommodations or support during the recruitment process due to a disability, please do not hesitate to contact us at talent@deliverect.com.\n\nReady to shape the future of commerce with us? Explore our opportunities and apply today!\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=4bec141006d0e236&bb=6eEMPDhkbhBLuYk_eNZhmYT6LrUy4wSy1i_WdNmCqRx2j0lPp-0DcISm2aWn7KFgz36gQ1RUtPdLSwgTjGgEDpEhvph-YKoLIO5nYQMmPyl8b_kv0H8i2YSEJIj5QBuToo9St7CMi4s6-e0gx9tdoQ%3D%3D&xkcb=SoDs67M3qzXpeBTNpp0KbzkdCdPP&fccid=fc51f670525dd49a&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "Offre de Stage : Stagiaire – AI Content Creator & Prompt Engineer",
    "company": "headly",
    "location": "Casablanca",
    "description": "Lieu : Casablanca\nType de contrat : Stage de 3 mois\nIndemnité : jusqu’à 2000 MAD / mois\nDescription du poste\nNous recherchons un(e) stagiaire créatif(ve) pour rejoindre notre équipe et contribuer à la création de contenu en utilisant l’intelligence artificielle (AI).\nSi tu maîtrises les outils d’AI et que tu sais rédiger des prompts efficaces pour générer des vidéos et images de haute qualité, ce stage est fait pour toi.\nMissions principales\nCréation de vidéos courtes avec Runway, Pika Labs, Luma, Stable Video, Veo 3…\nProduction d’images et visuels via Midjourney, Stable Diffusion, DALL·E\nRédaction de prompts détaillés et optimisés\nCréation de scripts courts (Reels / TikTok / Ads) avec ChatGPT\nParticipation à des séances de brainstorming et génération d’idées de contenu\nMontage vidéo simple avec CapCut / Premiere / DaVinci Resolve\nOptimisation de la qualité et adaptation du style au brand\nCompétences recherchées\nBonne compréhension des outils AI Video & AI Image\nCapacité à rédiger des prompts clairs et précis\nGrande créativité et passion pour l’AI\nConnaissances en montage vidéo (même niveau débutant)\nOrganisation et respect des deadlines\nBonus : expérience en création de contenu ou motion design\nProfil recherché\nÉtudiant(e) en communication, design, marketing ou informatique\nOu autodidacte avec un petit portfolio (même projets personnels)\nCandidature\nEnvoyer :\nCV → anwar100janaa@gmail.com\nPortfolio (obligatoire, même simple)\nWhatsApp : 0775551109\nالنُّسخة العربية الفصحى – AR إعلان توظيف: متدرب – صانع محتوى بالذكاء الاصطناعي ومهندس Prompt\nالموقع: الدار البيضاء\nنوع العقد: تدريب لمدة 3 أشهر\nالتعويض: يصل إلى 2000 درهم شهرياً\nوصف الوظيفة\nنبحث عن متدرب مبدع للانضمام إلى فريقنا والمساهمة في صناعة المحتوى باستخدام الذكاء الاصطناعي.\nإذا كنت تتقن أدوات الـAI وتعرف كيف تكتب prompts احترافية للحصول على صور وفيديوهات عالية الجودة، فهذا التدريب مناسب لك.\nالمهام الرئيسية\nإنتاج فيديوهات قصيرة باستخدام Runway – Pika Labs – Luma – Stable Video – Veo 3\nتصميم صور عبر Midjourney / Stable Diffusion / DALL·E\nكتابة Prompts دقيقة وقوية\nإعداد نصوص قصيرة (Reels / TikTok / إعلانات) باستخدام ChatGPT\nالمشاركة في جلسات الإبداع وابتكار أفكار للمحتوى\nمونتاج بسيط باستخدام CapCut / Premiere / DaVinci\nتحسين الجودة وتوحيد أسلوب المحتوى مع هوية العلامة\nالمهارات المطلوبة\nفهم جيد لأدوات AI لإنشاء الفيديو والصور\nالقدرة على كتابة prompts واضحة\nشغف وابتكار\nمعرفة أساسية بالمونتاج\nالانضباط واحترام المواعيد\nميزة إضافية: خبرة في التصميم أو الموشن غرافيك\nالمؤهلات\nطالب في الإعلام / التصميم / التسويق / المعلومات\nأو متعلم ذاتي مع Portfolio بسيط\nالتقديم\nأرسل:\nالسيرة الذاتية (CV) إلى: anwar100janaa@gmail.com\nPortfolio (ضروري — حتى لو أعمال بسيطة)\nواتساب: 0775551109\nType d'emploi : CDI, CDD, Stage\nDurée du contrat : 3 mois\nRémunération : 1.500,00DH à 2.500,00DH par mois",
    "job_url": "https://ma.indeed.com/rc/clk?jk=467377990d94eb25&bb=6eEMPDhkbhBLuYk_eNZhma-zONHQa6QsbMitktjlkmcMfb6mWEoyeT78So7YWXwkvygACNQV_fQkQSkTBx6yayR-LAcrW2KUA59mJNuq0DLbTsk43QtE2anyZftiwcReKTOfoBgvtz_k_ch2AOOw3w%3D%3D&xkcb=SoBx67M3qzXpeBTNpp0JbzkdCdPP&fccid=fa6e48e8ef93ca0e&cmp=headly&ti=Content+Creator&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "QA Automation Engineer",
    "company": "TransPerfect",
    "location": "Casablanca",
    "description": "TransPerfect Is More Than Just a Job… Our greatest asset is our people, and nothing is more important to us than ensuring that everyone knows that. Each of our 100+ offices has its own individual identity, and each also has its own unique rewards.\nWe are looking for engineers to join our growing team to work on highly visible, enterprise-wide software that is critical to TransPerfect’s success. The continued growth of the company gives us the opportunity to provide creative technology-based solutions to meet the challenges of the business. This is an exciting opportunity to write software that makes a direct impact on the company’s day-to-day activities and bottom line.\nJoin a truly global team and an industry leader with a startup attitude, and come make your mark by creating next generation applications using bleeding-edge technologies. At TransPerfect the sky is the limit, our AI/ML solutions are redefining the language industry's long-standing benchmarks and accepted norms, and your code could be part of this revolution.\nSummary:\nThe role of the QA Automation Engineer consists of designing, developing, and maintaining automated testing frameworks and tools to streamline the testing process and ensure software quality. The QA Automation Engineer plays a vital role in ensuring software products meet quality standards by automating repetitive testing tasks and enabling faster feedback to the development team. The QA Automation Engineer works closely with developers, product managers to understand software's functionality, requirements, and objectives. The QA Automation Engineer time allocation is as follows; 90% working on automation for user stories, and 10% working on deployment matters and QA support.\nCore Capabilities:\nDesign & Development: Design, develop, and maintain automated test frameworks and tools using programming languages and automation technologies that are compatible with the application under test.\nCommunication & Collaboration: Listen to the ideas and concerns of others to develop an understanding of how their ideas relate to others and act to address concerns.\nRisk Management: Identify risks and develop risk management plans/processes and successfully implement/operate them.\nAgile Ways of Working: Deep personal motivation to participate in Agile ceremonies.\nProblem Solving: Demonstrate the ability to look at problems from different points of view and try to find solutions.\nDigital Literacy: Keep up to date with the latest trends, tools, and best practices in QA automation, and share this knowledge with the team.\nDuties & Responsibilities:\nBe a part of a Scrum team working on Saas applications using modern JS frameworks and Java API microservice architecture.\nDevelop and maintain automated test scripts based on test cases, ensuring they are efficient, reliable, and maintainable.\nWork with the development team to integrate automated testing into the continuous integration and continuous deployment (CI/CD) pipeline, enabling faster feedback and earlier detection of defects.\nRun automated tests during different stages of the software development lifecycle, such as during build, integration, or release.\nReview and analyze the results of automated tests, identify defects, and report any issues to the development team.\nMaintain and update automated tests: Regularly update automated tests to reflect changes in the application, ensuring the tests remain relevant, efficient, and reliable.\nCollaborate with the development team: Work closely with developers to address defects, improve the software development process, and support continuous improvement.\nFollow a strong culture of security awareness and ownership using SDLC principles/methodologies.\nResponsible for testing within a complex environment that includes multiple connected systems.\nEnsure the reusability of all the components developed.\n\nEducation Preferred:\nBachelor's degree in Computer Science or equivalent\nWork Experience:\n2-3 years of experience as an Automation Engineer\nExperience working with Selenium, JUnit and TestNG as a Developer.\nExperience in Java and Selenium, wireframes design, scripting automation UI and Java\nExperience working with load testing tools like JMeter and Locust.\nExperience working in Agile/Scrum model.\nExperience of working in large projects involving multiple parties including Project Managers and third-party vendors on high profile and technologically innovative enterprise solutions.\nExperience with a wide variety of continuous integration and source control tools.\nProven track record of successful implementation of all project life cycle stages from requirements gathering through implementation and enhancements.\nUnderstand the fundamentals of DevSecOps CI/CD pipeline.\nExperience in building APIs for B2B, B2C product solutions.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=8a0fb51061289963&bb=6eEMPDhkbhBLuYk_eNZhmeRK4zLhNr4mASzN-r51H70HoDeeuPk2pnW3YsW8dt87Q47wbCZWnjFcCgAE0C6SFEabalRB8YE-ngm6CigtYrWHjlzX-5uTU_vnNmDmmGg4cWeZrtvu44ezWXh3CmGu_Q%3D%3D&xkcb=SoDF67M3qzXpeBTNpp0IbzkdCdPP&fccid=c5d28b9c196e7b6d&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "IOS Engineer",
    "company": "Swapcard",
    "location": "Remote",
    "description": "Our Mission\nSwapcard is the leading AI-powered event platform designed to drive revenue growth and foster meaningful connections at in-person and hybrid events. We recognize the importance of teamwork in successful events; that's why Swapcard is fueled by a team of innovators who are passionate about helping organizers build future-proof events.\n\nOur Vision\nAt Swapcard, we believe in the power of meaningful connections. This belief fuels our commitment to pioneering modern solutions that empower organizers to create engaging event experiences.\nGuided by our commitment to excellence and collaboration, we aim to redefine the landscape of event technology, setting new standards for engagement, accessibility, and impact.\n\nOur Beliefs\nAt Swapcard, diversity is at the core of our success. With 42 nationalities represented among our 180+ team members, we champion diversity as a catalyst for creativity, collaboration, and unparalleled innovation.\n\nWe believe that by embracing a multitude of backgrounds, cultures, and viewpoints, we can truly understand and cater to the needs of our global community of event organizers and participants.\nOur full remote opportunities empower our team to thrive, no matter where they are in the world, fostering a culture of flexibility and inclusion.\n\nAre you a skilled and passionate iOS Engineer ready to take on exciting challenges in mobile app development? Join our dynamic team and play an important role in creating hundreds of branded apps that delight users worldwide. We're looking for a talented individual who can harness the power of iOS, Swift & UIKit to build exceptional mobile experiences.\nResponsibilities\niOS 16 Plus: You'll be working with the latest iOS versions, utilising its advanced features and improvements to create modern and efficient apps.\nSwift & UIKit: As the foundation of our development stack, your proficiency in Swift and UIKit will be vital in crafting robust and user-friendly interfaces.\nSwiftUI: When appropriate, we embrace SwiftUI.\nCoordinators: You will work with Coordinators, ensuring efficient navigation and data flow throughout the app.\nMVC/MVVM: Our apps follow a structured approach, utilising both MVC and MVVM patterns to maintain clean and maintainable codebases.\nUnidirectional Flow: We are experimenting with Unidirectional Flow architecture with a potential to switch to it completely over time.\nFigma, Notion, Jira, GitHub: Those are our main tools to collaborate within the team.\nCI on Jenkins: Our continuous integration process on Jenkins ensures automated builds and app distribution.\nHundreds of Branded Apps with Automated Distribution: Be part of a team that manages a vast portfolio of branded apps, ensuring quick distribution to the store.\nDependency Injection: We use dependency injection to ensure our screens stays modular and could be tested.\nGraphQL & Apollo: Our main API is written in GraphQL and we use Apollo to work with it. It provides us with great tools and flexibility.\nREST & Sockets: While the main part of the app is written in GraphQL we also have parts that work with REST Protocol. We have also implemented a Socket Client to update some of our screens in the real time.\nSPM: For third party dependencies we have completely migrated out project to SPM.\nAnd More: We have a lot more to share about the project. We have chat, video player, picture in picture, video calls, maps integration, in-app language switch and others. Join us to explore the project and make your own contribution!\nQualifications\niOS Expertise: Demonstrated experience in iOS development, proficient in Swift.\nUIKit & SwiftUI: Strong expertise in UIKit is essential, with a willingness to adopt SwiftUI where applicable.\nArchitectural Proficiency: Familiarity with Coordinators, MVC, and MVVM architecture. Experience with Unidirectional Flow architecture is a plus.\nProblem-Solving Skills: Ability to tackle complex challenges with a logical and innovative approach.\nCollaborative Team Player: Excellent communication and teamwork skills, collaborating effectively with designers, product managers, and fellow developers.\nBonus\nExciting Projects: Join a team with a diverse range of projects, working on different and non-trivial topics that challenge and inspire.\nCollaborative Environment: Work closely with two experienced iOS Engineers in a collaborative and supportive environment that encourages sharing knowledge and expertise.\nProfessional Growth: We prioritise your professional growth and provide opportunities for skill development and career advancement.\nModern Technologies: We use many of modern approaches from iOS world. At the same time we are also making sure that we don’t simply jump on a hype-train, but ensure the technology fits our needs.\nFull Remote: We value work-life balance and foster a flexible work environment that promotes productivity and well-being.\n\nSwapcard’s Interview process\nOur thorough interview process aims to identify exceptional talent to advance our mission while offering you a chance to explore your career potential at Swapcard.\n\n1. Screening Interview with a recruiter from our people team.\n2. A remote exercise to demonstrate and assess your skills.\n3. Manager review with your future reporting manager\n4. Leadership review with one of our department leaders\n5. Reference check conducted by our people team\n6. Offer\n\nSwapcard's Values\n\\uD83E\\uDDE0 Curious: We ask questions, try new things and take risks. We learn from one another and see mistakes as opportunities to grow—what matters most is how we react and learn from them. We are curious about what something is and why something is. Innovation thrives when curiosity drives.\n\\uD83D\\uDDDD️ Value-Driven: At Swapcard, we focus on making each decision count by prioritising outcomes that create meaningful value for our customers, team members, and partners.\n\\uD83D\\uDC9A Human: At Swapcard, being human means fostering empathy, openness, and diversity to create a caring and collaborative community. We’re driven by a strong team spirit and a shared goal of building meaningful connections—both through our product and within our team.\n✊ Resilient: We embrace challenges with optimism, creativity, and adaptability, constantly seeking innovative solutions and opportunities for growth.\n\\uD83D\\uDC51 Ownership: At Swapcard, we take responsibility and are accountable for our actions, driving success through initiative, trust, and accountability. True ownership means more than just completing tasks; it's about being proactive, investing ourselves fully in the outcomes, and fostering a culture of trust.\n\nBenefits & Reasons to Join Swapcard\nInternational team with 40+ nationalities (more on the way!) \\uD83C\\uDF0D\nRemote-first policy with headquarters in Paris \\uD83D\\uDDFC\nThriving startup with career growth opportunities \\uD83E\\uDEB4\nOpen-minded culture that appreciates differences \\uD83D\\uDC7D\nFeedback-driven, supportive & curious team with a DIY mindset \\uD83E\\uDD14 \\uD83D\\uDEE0\nGenerous Paid Time Off to ensure you have time for what matters most ❤️\\uD83C\\uDFE1\nRemote perks designed to optimize your working experience \\uD83C\\uDF81\nIn-person social gatherings to celebrate our achievements \\uD83C\\uDFDD️\n100% of your health insurance contribution paid by Swapcard \\uD83C\\uDFE5\nWork-from-home budget (one-off contribution for equipment in addition to your initial equipment setup) \\uD83D\\uDD87️\nCo-working space budget to support remote work in professional environments \\uD83D\\uDCBC\nLearning budget to help you develop new and existing skills \\uD83E\\uDD13\nMental health care initiatives to support your well-being \\uD83E\\uDDD8\n\nEqual Opportunity\nSwapcard is committed to upholding equal employment practices and making merit-based employment decisions. We welcome individuals from all backgrounds, abilities, and experiences to apply, regardless of race, nationality, religion, sexual orientation, gender identity, pregnancy status, age, marital status, and status as a veteran\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=d2ea7c00963159b3&bb=6eEMPDhkbhBLuYk_eNZhmcVkRLzvZICw6CXtana6ikbNdYAZ35a60FsxqOaUvPXK35DgsgR80mgL6o98P0C7wlWwt1rt1M5HBq5bts8-70FGXSK9OywPdvDVTaFrSsocHRSM_RI91D-7IwV_WoWYow%3D%3D&xkcb=SoBL67M3qzXpeBTNpp0PbzkdCdPP&fccid=c45b4b9e5aa458f0&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "Software Engineer - Backend (Senior, Remote)",
    "company": "Lucidya",
    "location": "Remote",
    "description": "Lucidya is an AI-native company transforming how brands understand and engage with their customers through cutting-edge technologies purpose-built for Customer Experience (CX). With AI at the core of our platform and operations, we are redefining how businesses drive growth, loyalty, and insight at scale.\nWe are looking for Sr Backend Engineers to join our team. You will join a team of highly qualified team engineers to continue the innovation and development of our product which uses Machine Learning & Big Data technologies to analyze content from several data sources.\nAs a developer, you will be working on the backend of our product Lucidya which is built using industry’s latest technologies such as Redis, Postgres and Cassandra and developing APIs using Python and Ruby on Rails. The job also includes DevOps tasks from server setup to maintenance and recovery.\nYou will work directly under the Engineering Manager in an agile yet demanding environment. We expect you to be a fast learner to adapt those technologies mentioned above fast.\nLucidya offers a result-driven, fun, and dynamic environment full of challenges, We look for very talented candidates with strong programming skills.\nKey Tasks & Responsibilities\nRapidly develop next-generation scalable, flexible, and high-performance systems.\nDesign, develop, test, deploy, maintain and improve software (backend and databases in particular)\nManage individual project priorities, deadlines and deliverables.\nDevOps tasks\nContribute to the growth of Lucidya through interviewing, on-boarding, or other recruitment efforts\nRequirements\nBA/BS or or Masters degree in Computer Science, Software Engineering, IT or equivalent practical experience\n+6 years of experience\nStrong knowledge in SQL and noSQL databases such as (Redis , Postgress or Cassandra)\nFluency in Python and Ruby on Rails.\nKnowledge in Web servers and Web application servers (e.g., Apache, Jetty, Tomcat, IIS)\nKnowledge in code repository like Git\nAbility to multi-task and adapt to shifting priorities, demands, and tight timelines\nDatabase design skills\nPerfect quality code\nExcellent organizational skills and proven analytical, planning, problem solving skills\nFull stack with background in ReactJS is a plus",
    "job_url": "https://ma.indeed.com/rc/clk?jk=6b8a2dbf48d88c06&bb=6eEMPDhkbhBLuYk_eNZhmXQ6p57hA1ZU8rQBGNonGQos5iASG2_muCU7Qy3XNt8nr0jFsZBxGnCfiDqYRD90zSltS23zSKRq3qUokd8m7QAv1WGwKvqpa-6mNytGXCcPBcxmR7Ut_L24HtSDKa5zPA%3D%3D&xkcb=SoD_67M3qzXpeBTNpp0ObzkdCdPP&fccid=614a3ab169be0ae7&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "AI Software Engineer (F/H/X)",
    "company": "Syensqo",
    "location": "Ben Guerir",
    "description": "Syensqo is all about chemistry. We’re not just referring to chemical reactions here, but also to the magic that occurs when the brightest minds get to work together. This is where our true strength lies. In you. In your future colleagues and in all your differences. And of course, in your ideas to improve lives while preserving our planet’s beauty for the generations to come.\n\nJob title :\nAI Software Engineer (F/H/X)\n\nThe position reports to the Technical Lead.\n\nKey Responsibilities:\nCollaborate and Innovate: Work closely with product managers, designers, and other engineers to build best-in-class AI-enabled features for our products.\nAI Integration: Implement and integrate AI technologies, such as Generative AI, machine learning models, or NLP, to enhance our platform’s capabilities, optimize processes, and improve user experiences.\nPlatform Development: Design, develop, and maintain scalable AI platform features to enable feature teams, while ensuring they are compatible with other services, and APIs.\nRapid Problem-Solving: Quickly fix bugs and solve problems, particularly related to AI performance, model integration, or data pipeline issues, to enhance customer satisfaction.\nContinuous Improvement: Participate in code reviews and contribute to improving our AI development processes, ensuring that the AI components are scalable, efficient, and maintainable.\nStay Current: Maintain up-to-date knowledge of industry trends and advancements in AI, machine learning, and cloud services\n\nEducation and experiences\nSpecific Knowledge/Experience:\nAt least 4 years of experience as a Software Engineer\nProven track record of working in AI products development\nExpertise in Python, valuable Java, Scala, C#\nKnowledge in microservices, valuable graphQL\nKnowledge in Data management & data structures such as Json schema, Avro\nKnowledge in DevOp as Jenkins pipelines, docker and some experience deploying models (MLOps, LLMOps, AIOps)\nStrong understanding of GenAI/AI/ML technologies with knowledge in concepts as AI flow, evaluation, training, scoring, prompting, guardrails and RAG\nExperience with Cloud providers as Azure, GCP or AWS\nExperience in Agile development methodologies, particularly SCRUM.\nValuable knowledge: distributed architectures, akka concepts, NLP projects, standard methodologies and principles, software patterns\nProficiency in using project management and collaboration tools (e.g., JIRA, Trello)\nStrong organizational & time management skills\nCloud certifications is a plus\nFluent in English (proficient in French is a plus).\nStrong analytical and problem-solving skills.\nCreativity, curiosity and a passion for innovation and technology.\n\nAbout us\nThis position requires a certain level of integrity, confidentiality, loyalty and trustworthiness as you will have access to Syensqo's most sensitive information or systems in the context of your mission. Please note that the selected person for this position will be required to undergo and meet company standards for vetting verifications and reference checks.\nSyensqo is a science company developing groundbreaking solutions that enhance the way we live, work, travel and play. Inspired by the scientific councils which Ernest Solvay initiated in 1911, we bring great minds together to push the limits of science and innovation for the benefit of our customers, with a diverse, global team of more than 13,000 associates. Our solutions contribute to safer, cleaner, and more sustainable products found in homes, food and consumer goods, planes, cars, batteries, smart devices and health care applications. Our innovation power enables us to deliver on the ambition of a circular economy and explore breakthrough technologies that advance humanity.\nAt Syensqo, we seek to promote unity and not uniformity. We value the diversity that individuals bring and we invite you to consider a future with us, regardless of background, age, gender, national origin, ethnicity, religion, sexual orientation, ability or identity. We encourage individuals who may require any assistance or accommodations to let us know to ensure a seamless application experience. We are here to support you throughout the application journey and want to ensure all candidates are treated equally. If you are unsure whether you meet all the criteria or qualifications listed in the job description, we still encourage you to apply.\n\nLI-IJ1LI-Onsitesenior",
    "job_url": "https://ma.indeed.com/rc/clk?jk=57b06245fa4cacca&bb=6eEMPDhkbhBLuYk_eNZhmYb9HFiiziCytxE57iaehtpxK9AQiFxtPkRd7xyoMjUfi6ZyMT8KN8M9ErApObhbjSjoOHNyW9ds1buXACKjlHmIFj3UPo225kBDqUxbADSIk9c0ZJ5WtpnQoyrTF9LB-w%3D%3D&xkcb=SoBi67M3qzXpeBTNpp0NbzkdCdPP&fccid=0354b461c4536ec9&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=57b06245fa4cacca&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=a7aeb4a734452e0e&assa=5646",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "AI and Cloud Technologies Trainer - Northern Africa (Arabic speaking)",
    "company": "Upskill Universe",
    "location": "Marrakech",
    "description": "UpSkill Universe was founded on the principle of empowering individuals, organisations and their leadership to adapt to the ever-changing digital landscape. We develop and deliver human-centred, experiential learning programmes and events for organisations looking to empower people and stimulate economies from a grassroots level.\nUsing our incredible roster of talent (that’s you!), we empower teams to adapt as roles change and evolve so that businesses and individuals remain relevant and competitive in an ever-changing, digitally disrupted landscape.\nWhat's more, we do this all virtually, using the latest technologies to ensure that our learning experiences reach the right people in the right way.\nDoes this all sound exciting? Great, because we need YOU to help us drive our learning programs. We are committed to working with the best training experts in the business to engage, excite and educate consumers and businesses on technology, tools and solutions that will empower all people to succeed with tech.\nRole overview\n\nThe freelance AI and Cloud Technologies Trainer will work on remote and in-person delivery, with flexible scheduling. The trainer must also be based near and available to work in Northern African time zones to meet the needs of participants across the region.\nMain duties\nTraining Delivery:\nDeliver high-quality training sessions on AI and cloud technologies\nUse the publicly available frameworks to structure training content, ensuring a comprehensive exploration of data, infrastructure, policy, and education.\nAdept at virtual training delivery, competent in use of Google Meets.\n\nStakeholder Engagement:\nEngage with a variety of stakeholders to understand their specific learning needs and challenges.\nProvide tailored advice and guidance to participants, helping them apply the concepts learned to their specific contexts.\n\nAssessment and Feedback:\nAssess the effectiveness of your training sessions through ensuring participant feedback completion (via our satisfaction surveys), assessments, and engagement metrics.\nProvide constructive feedback to participants to aid their understanding and application of AI and cloud technologies.\n\nContinuous Improvement:\nStay updated on the latest developments in AI, cloud technologies, and their applications for social good, particularly within the Northern Africa region.\nContribute to the continuous improvement of training programs by incorporating new insights, technologies, and best practices.\nEssential Qualifications and Experience\nLanguage Proficiency: Fluent in English and Arabic.\n\nBachelor’s degree in Computer Science, Information Technology, International development or a related field.\nProfessional certification in Google Cloud Platform (e.g., Google Cloud Certified - Professional Data Engineer, Professional Cloud Architect).\nProven experience (minimum 3 years) as an AI Trainer or similar role.\nA minimum of 3 years of experience in facilitating virtual training sessions, specifically in technical subjects such as AI, cloud technologies, or related fields, with a proven ability to engage participants, manage group dynamics, and adapt teaching methods to different adult learning styles\nStrong knowledge of AI technologies, including machine learning, deep learning, NLP, and computer vision.\nExperience with AI frameworks and tools.\nAdvanced skills in using digital platforms and interactive tools for remote training, such as Zoom, Google Meet, and interactive whiteboard tools.\nDesired qualifications and experience\nCertification or formal training in AI ethics, data privacy, or relevant policy frameworks.\nSubmission requirement\nTo apply for the role of AI & Cloud trainer, please complete the following steps:\nSubmit Your CV: Include relevant professional experience, qualifications, and certifications, particularly in digital marketing and training delivery.\nOptional: Submit your Linkedin and a cover letter explaining why you would be a good fit for this role.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=5c14af5018763ee3&bb=6eEMPDhkbhBLuYk_eNZhmdYnQVpvgUPvK2bqmD5DT4mdYziPmihnd_TFS1WJf2CcMJOuJBMTiUDiQbWvI9-a453wfNKoHwaq6ACUDGA-HQLZYZ1Wz9k7ml7mct6M607oMK7GSecK84-1xiaIE6unfQ%3D%3D&xkcb=SoDW67M3qzXpeBTNpp0MbzkdCdPP&fccid=e47adc9edf88049d&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=5c14af5018763ee3&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=5b719348bbbd0b5f&assa=261",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "PFE Internship Opportunity – AGADIR",
    "company": "PayNow",
    "location": "Agadir",
    "description": "PayNow, a leading fintech company specializing in innovative digital payment solutions, is offering 6 final-year PFE internship positions .\nThis is a great opportunity to work on real projects, learn from experienced engineers, and contribute to cutting-edge solutions.\nAvailable PFE Topics: AI for Test Automation\nAI for Document Scanning with Arabic Handwriting Recognitio\nBiometric Payment Systems\nIf you’re passionate about AI, fintech, and innovation, Send your CV and mention the topic(s) you’re interested in to f.merjaa@paynow.ma .\nType d'emploi : Temps plein",
    "job_url": "https://ma.indeed.com/rc/clk?jk=f5a62645566a2a14&bb=6eEMPDhkbhBLuYk_eNZhmc2DOp8wr3AZG7_271BWvkTtbu-eEIIzDwB4SseW4nF6NlvWCBjcqET6OTTnB6KG7mF6PqtOrpD39fGB2MpEivzjfNcfjl1F9573QrdZB6pSicLo4LoXEBLeR-wWQ34PVA%3D%3D&xkcb=SoA_67M3qzXpeBTNpp0DbzkdCdPP&fccid=39125bcd72dbf577&cmp=Paynow&ti=Summer+Intern&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "Contact Center AI Engineer - Hybrid",
    "company": "Walter",
    "location": "Casablanca",
    "description": "Job Overview:\nWe are seeking a Contact Center AI Engineer to join our client's team. In this role, you will work closely with their contact center operations team to deploy and customize AI copilots for various use cases within contact center environments. You will be responsible for writing technical requirements, mapping customer needs, and conducting light integrations with contact center applications. As a brand ambassador and local product evangelist, you will be responsible for understanding, promoting, and presenting our solutions to both internal teams and external stakeholders.\n\nResponsibilities:\nPartner with contact center operational leads to translate contact center operational needs into scalable AI copilot solutions.\nMapping customer requirements into clear technical specifications for low-code or API-based integrations.\nConduct hands-on integrations and API configurations with CRMs, telephony systems, case management tools, and data mapping to tailor AI copilots for specific contact center use cases.\nDesign and document technical requirements and data flows to guide development and ensure seamless\nIntegration with contact center platforms.\nServe as a trusted advisor and local evangelist for AI-driven contact center solutions, delivering demos, workshops, and stakeholder briefings.\nProvide prompt engineering and optimization support to refine AI copilot responses and enhance customer interactions.\nStay abreast of emerging trends in generative AI, conversational AI, and contact center technologies, proactively identifying opportunities for innovation.\nBridge communication between technical teams, operations leaders, and client stakeholders to ensure solutions deliver measurable business outcomes.\nDevelop training materials, user guides, and knowledge assets to drive adoption and empower end-users.\nTrack and analyze solution performance metrics, generating insights and recommendations for ongoing\nimprovement.\nAct as a brand ambassador, promoting our solutions internally and externally to build excitement and drive market success.\nRequirements:\nBachelor’s degree in Computer Science, Computer Engineering, Information Systems, or a related field\nExperience in AI\nExperience in Python Development\nExperience in RAG\nHands-on experience designing technical requirements and documenting data flows for low-code or API-based integrations.\nExperience with prompt engineering and optimization in generative AI or conversational AI solutions.\nPreferred Qualifications:\nExperience working in or with contact centers\nUnderstanding of key contact center metrics and operations management principles\nAdvanced skills in prompt engineering, including concepts such as zero-shot, few-shot, chain-of-thoughts, and others.\nFamiliarity with API integrations and technical solution design for SaaS or cloud-based platforms.\nPrevious experience as a product evangelist or in a similar role promoting technology solutions.\nProficiency in data analysis and visualization tools (e.g., Excel, Power BI, Tableau)\nExperience with agile methodologies",
    "job_url": "https://ma.indeed.com/rc/clk?jk=dc75a6bc88706b03&bb=6eEMPDhkbhBLuYk_eNZhmbtqzRpV8I0kVQZSG6rtQI0s-MWAL1REfRwLQWlUJ8ayJ2iN94n4WaouirAkdj5-XcYu6M8dZ3KzPTZ3POkgzfwGKSyLCnfq4B_AvTbw0yhkmnElek-2pREGp6vTfjkPBA%3D%3D&xkcb=SoCL67M3qzXpeBTNpp0CbzkdCdPP&fccid=7809ab4e045d14b7&vjs=3",
    "apply_url": "",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "Supply Chain Engineer",
    "company": "Capgemini Engineering",
    "location": "Casablanca",
    "description": "At Capgemini Engineering, the world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nKey Responsibilities\nInventory Management\nSupplier Coordination: Work closely with suppliers to resolve logistics issues & Support on IT system updates and manipulation\nData Analysis & Reporting: Analyze data on stock & costs, and generate regular reports\nProcess Improvement: Implement continuous improvement initiatives\nCross-Functional Collaboration: Coordinate with production, logistics, and procurement teams to forecast needs and anticipate demand changes.\nQualifications\nEngineer or equivalent (BAC+5) in Logistics or Industrial Engineering\n2+ years of experience in logistics, supply chain management or inventory management\nStrong analytical skills\nExcellent communication and interpersonal skills for effective cross-functional collaboration.\nDetail-oriented, organized, and capable of managing multiple priorities.\nFLUENT ENGLISH\nSolid knowledge of data analysis tools (Microsoft Excel, Power BI, Tableau..) is advantageous\nSkills (competencies)\nAttentiveness\nContinuous Learning\nData Analysis\nDecision-Making\nEnglish Fluency\nExcel\nIndustry Knowledge\nIndustrial Ecosystems\nMicrosoft Excel\nMicrosoft Office\nMicrosoft Power BI\nMicrosoft Word\nMotivation\nMulti-Tasking\nNegotiation\nPower BI\nPresentation skills\nProcurement\nProblem Solving\nPython\nSAP S/4HANA - Inventory\nSAP S/4HANA - Sourcing and Procurement\nSAP S/4HANA - Transportation\nSAP S/4HANA - Warehouse Management\nSupplier Management\nSupply Forecasting\nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem.",
    "job_url": "https://ma.indeed.com/rc/clk?jk=5890d41efe5c82d8&bb=6eEMPDhkbhBLuYk_eNZhmQa3usDuWSTVtbdR4er_Eg5e00S0BX2DIMG2I1AfQVvUTUaUz-t8vSUms-q4MZUNXi-3IjoKcBT7XKj1F-175BcLu48ouV1TsML6cL34Hg9zs15g-aZJOl2J7h59OQAuIg%3D%3D&xkcb=SoAW67M3qzXpeBTNpp0BbzkdCdPP&fccid=80402dcb603cbc8d&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=5890d41efe5c82d8&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=65b3c3d2155de17d&assa=1172",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "Senior AI Software Engineer (F/H/X)",
    "company": "Syensqo",
    "location": "Ben Guerir",
    "description": "Syensqo is all about chemistry. We’re not just referring to chemical reactions here, but also to the magic that occurs when the brightest minds get to work together. This is where our true strength lies. In you. In your future colleagues and in all your differences. And of course, in your ideas to improve lives while preserving our planet’s beauty for the generations to come.\n\nJob title :\nSenior AI Software Engineer (F/H/X)\n\nJob overview and responsibilities\nSyensqo initiated a fundamental transformation and this transformation positioned digital technologies as key drivers to make it happen. It requires us to change the way we operate and leverage the tremendous amount of knowhow, knowledge, structured and unstructured datasets that today exist in the Group.Syensqo has decided to create a startup team, Syensqo.ai, dedicated to the AI and Generative AI domain. By taking this role, the AI Software Engineer will join this team right at its inception. Its mantra is simple: deliver value, with speed and agility while taking no compromise on cybersecurity, compliance, ethics, guardrails or regulations. S/he will contribute to the growth and development of this startup by maintaining a strong focus on excellence and implementing prioritized solutions in a fast and agile manner. With a commitment to innovation, excellence and sustainable growth, we are looking for a talented AI Software Engineer to join our team and drive the creation of cutting-edge AI solutions. In our agile and collaborative work environment we have fun to live our motto: advancing humanity.\n\nThe position reports to the Technical Lead.\n\nKey Responsibilities:\nCollaborate and Innovate: Work closely with product managers, designers, and other engineers to build best-in-class AI-enabled features for our products.\nAI Integration: Implement and integrate AI technologies, such as Generative AI, machine learning models, or NLP, to enhance our platform’s capabilities, optimize processes, and improve user experiences.\nPlatform Development: Design, develop, and maintain scalable AI platform features to enable feature teams, while ensuring they are compatible with other services, and APIs.\nRapid Problem-Solving: Quickly fix bugs and solve problems, particularly related to AI performance, model integration, or data pipeline issues, to enhance customer satisfaction.\nContinuous Improvement: Participate in code reviews and contribute to improving our AI development processes, ensuring that the AI components are scalable, efficient, and maintainable.\nStay Current: Maintain up-to-date knowledge of industry trends and advancements in AI, machine learning, and cloud services\n\nSpecific Knowledge/Experience:\nAt least 7 years of experience as a Software Engineer\nProven track record of working in AI products development\nExpertise in Python, valuable Java, Scala, C#\nKnowledge in microservices, valuable graphQL\nKnowledge in Data management & data structures such as Json schema, Avro\nKnowledge in DevOp as Jenkins pipelines, docker and some experience deploying models (MLOps, LLMOps, AIOps)\nStrong understanding of GenAI/AI/ML technologies with knowledge in concepts as AI flow, evaluation, training, scoring, prompting, guardrails and RAG\nExperience with Cloud providers as Azure, GCP or AWS\nExperience in Agile development methodologies, particularly SCRUM.\nValuable knowledge: distributed architectures, akka concepts, NLP projects, standard methodologies and principles, software patterns\nProficiency in using project management and collaboration tools (e.g., JIRA, Trello)\nStrong organizational & time management skills\nCloud certifications is a plus\nFluent in English (proficient in French is a plus).\nStrong analytical and problem-solving skills.\nCreativity, curiosity and a passion for innovation and technology.\n\nAdditional information :\nContract type : permanent contract / CDI\n\nAbout us\nSyensqo is a science company developing groundbreaking solutions that enhance the way we live, work, travel and play. Inspired by the scientific councils which Ernest Solvay initiated in 1911, we bring great minds together to push the limits of science and innovation for the benefit of our customers, with a diverse, global team of more than 13,000 associates. Our solutions contribute to safer, cleaner, and more sustainable products found in homes, food and consumer goods, planes, cars, batteries, smart devices and health care applications. Our innovation power enables us to deliver on the ambition of a circular economy and explore breakthrough technologies that advance humanity.\nAt Syensqo, we seek to promote unity and not uniformity. We value the diversity that individuals bring and we invite you to consider a future with us, regardless of background, age, gender, national origin, ethnicity, religion, sexual orientation, ability or identity. We encourage individuals who may require any assistance or accommodations to let us know to ensure a seamless application experience. We are here to support you throughout the application journey and want to ensure all candidates are treated equally. If you are unsure whether you meet all the criteria or qualifications listed in the job description, we still encourage you to apply.\n\nLI-IJ1LI-Onsitesenior",
    "job_url": "https://ma.indeed.com/rc/clk?jk=dad07bac2a782e1c&bb=6eEMPDhkbhBLuYk_eNZhmW3mcPu1CNB87dl6OllrQMX0SA2IKA_PiQJH9rnWdYpjsXVVCHLNuOPgBJOk0-8X77m2_bftVu0I7P5ui6JHyhsQ5hIVxALTpqMA2Vl-Z1r6yMQGJMzdi4CVluHwW_epJg%3D%3D&xkcb=SoCi67M3qzXpeBTNpp0AbzkdCdPP&fccid=0354b461c4536ec9&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=dad07bac2a782e1c&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=ee1e939dd840a106&assa=4348",
    "extract_date": "2025-12-04"
  },
  {
    "search_keyword": "AI engineer",
    "title": "Data Scientist I - QuantumBlack, AI by McKinsey",
    "company": "McKinsey & Company",
    "location": "Casablanca",
    "description": "Job ID: 100307\nCasablanca\nJohannesburg\n\n\n\nDo you want to work on complex and pressing challenges—the kind that bring together curious, ambitious, and determined leaders who strive to become better every day? If this sounds like you, you’ve come to the right place.\nYOUR IMPACT\nAs a Data Scientist I, you will collaborate with clients and interdisciplinary teams to develop impactful analytics solutions, optimize code, and solve real-world business problems across diverse industries. You’ll grow as a technologist by contributing to cutting-edge projects, R&D, and global conferences while working alongside world-class talent in a dynamic, innovative environment.\nIn this role, you will partner with clients to understand their needs and develop impactful analytics solutions. You will translate business problems into analytical challenges, build models to solve them, and ensure they are evaluated with relevant metrics. You’ll also contribute to internal tools, participate in R&D projects, and have opportunities to attend and present at conferences like NIPS and ICML.\nYour work will create real-world impact. By identifying patterns in data and delivering innovative solutions, you will help clients maintain their competitive advantage and transform their day-to-day operations. Your contributions will directly influence business outcomes and drive lasting improvements across industries.\nYou will be based in either one of our McKinsey Digital Africa office - Johanessburg or Casablanca, and collaborate closely with data scientists, data engineers, machine learning engineers, designers, and product managers around the world working on interdisciplinary projects that use math, statistics, and machine learning to derive insights from raw data. You will help global companies transform their businesses and enhance performance across industries such as healthcare, automotive, energy, and elite sports.\nAt McKinsey, you’ll thrive in an unparalleled environment for growth. You’ll develop a sought-after perspective by connecting technology and business value, tackle real-life challenges across diverse industries, and collaborate with inspiring multidisciplinary teams, gaining a holistic understanding of AI and its potential to drive transformation.\nYOUR GROWTH\nDriving lasting impact and building long-term capabilities with our clients is not easy work. You are the kind of person who thrives in a high performance/high reward culture - doing hard things, picking yourself up when you stumble, and having the resilience to try another way forward.\nIn return for your drive, determination, and curiosity, we'll provide the resources, mentorship, and opportunities you need to become a stronger leader faster than you ever thought possible. Your colleagues—at all levels—will invest deeply in your development, just as much as they invest in delivering exceptional results for clients. Every day, you'll receive apprenticeship, coaching, and exposure that will accelerate your growth in ways you won’t find anywhere else.\nWhen you join us, you will have:\nContinuous learning: Our learning and apprenticeship culture, backed by structured programs, is all about helping you grow while creating an environment where feedback is clear, actionable, and focused on your development. The real magic happens when you take the input from others to heart and embrace the fast-paced learning experience, owning your journey.\nA voice that matters: From day one, we value your ideas and contributions. You’ll make a tangible impact by offering innovative ideas and practical solutions, all while upholding our unwavering commitment to ethics and integrity. We not only encourage diverse perspectives, but they are critical in driving us toward the best possible outcomes.\nGlobal community: With colleagues across 65+ countries and over 100 different nationalities, our firm’s diversity fuels creativity and helps us come up with the best solutions for our clients. Plus, you’ll have the opportunity to learn from exceptional colleagues with diverse backgrounds and experiences.\nWorld-class benefits: On top of a competitive salary (based on your location, experience, and skills), we provide a comprehensive benefits package to enable holistic well-being for you and your family.\nYOUR QUALIFICATIONS AND SKILLS\nBachelors, Masters or PhD level in a discipline such as: computer science, machine learning, applied statistics, mathematics, engineering or artificial intelligence\nUp to 3 years of professional experience in applying machine learning and data mining techniques to real problems with copious amounts of data\nProgramming experience (focus on machine learning): R and/or Python (must), SPSS, SAS, Ruby, Hadoop (valued)\nAbility to prototype statistical analysis and modeling algorithms and apply these algorithms for data driven solutions to problems in new domains\nAbility to independently own and drive model development, balancing demands and deadlines\nDemonstrated aptitude for analytics\nWhile we advocate for using the right tech for the right task, we often leverage the following technologies: Python, PySpark, the PyData stack, SQL, Airflow, Databricks, our own open-source data pipelining framework called Kedro, Dask/RAPIDS, container technologies such as Docker and Kubernetes, cloud solutions such as AWS, GCP, and Azure, and more\nExceptional time management to meet your responsibilities in a complex and largely autonomous work environment\nWillingness to travel\nGood presentation and communication skills, with the ability to explain complex analytical concepts to people from other fields\nStrong communication skills, both verbal and written, in English and local office language(s), with the ability to adjust your style to suit different perspectives and seniority levels",
    "job_url": "https://ma.indeed.com/rc/clk?jk=69548b1f302d8fc3&bb=6eEMPDhkbhBLuYk_eNZhmb9GXEsvqTMzFFd_obptGQqcdaZ3TJKrv3btM8fiXb1z7TJyw7BAYN49nE1mTxKD1yOthnbkuWl6JqFQVp4qHm_zTphqLv2Qm4h-ScwhvWJDTeXUgFdAi6ZEDT1y9YHMZw%3D%3D&xkcb=SoAs67M3qzXpeBTNpp0HbzkdCdPP&fccid=6576e7250aa78c3c&vjs=3",
    "apply_url": "https://ma.indeed.com/applystart?jk=69548b1f302d8fc3&from=vj&pos=bottom&mvj=0&spon=0&vjfrom=serp&asub=mob&astse=38cecefc806d85f7&assa=7712",
    "extract_date": "2025-12-04"
  }
]